{
	"people" : [
		{
		    "name": "Luke Skywalker", 
		    "height": "172", 
		    "mass": "77", 
		    "hair_color": "blond", 
		    "skin_color": "fair", 
		    "eye_color": "blue", 
		    "birth_year": "19BBY", 
		    "gender": "male", 
		    "homeworld": "Tatooine",
		    "species": "Human",
		    "description": "Luke Skywalker was a Force-sensitive Human male who helped defeat the Galactic Empire in the Galactic Civil War and helped found the New Republic, as well as the New Jedi Order. Born in 19 BBY as the son of the fallen Jedi Knight Anakin Skywalker and the Queen and Senator of Naboo, Padmé Amidala, Luke was raised on Tatooine and hidden from Emperor Palpatine and his father, who had recently become Darth Vader, Dark Lord of the Sith. In 0 BBY, Skywalker's life changed forever. A chance purchase of two droids, R2-D2 and C-3PO, led to him to receive training in the ways of the Force from Jedi Master Obi-Wan Kenobi and to meet Han Solo, and Princess Leia Organa, who was, unbeknownst to him, his twin sister. Skywalker then destroyed the first Death Star and joined the Rebel Alliance. Over the next few years, he fought in many of the most important battles of the Galactic Civil War, helping to found Rogue Squadron and fighting Imperial forces across the galaxy. In 3 ABY, Skywalker received Jedi training from Yoda, and learned from Vader that the Sith Lord was his father. One year later, he fought in the Battle of Endor, and succeeded in turning his father back to the light. Thanks to Skywalker, Palpatine was killed, and the Empire was dealt a crippling blow. One year later, the New Republic was formed.",
		    "image": "http://vignette1.wikia.nocookie.net/starwars/images/d/d9/Luke-rotjpromo.jpg/revision/latest?cb=20091030151422"
		},
		{
			"name": "C-3PO", 
		    "height": "167", 
		    "mass": "75", 
		    "hair_color": "n/a", 
		    "skin_color": "gold", 
		    "eye_color": "yellow", 
		    "birth_year": "112BBY", 
		    "gender": "n/a", 
		    "homeworld": "Tatooine",
		    "species": "Droid",
		    "description": "C-3PO, sometimes spelled See-Threepio and often referred to as Threepio, was a bipedal, humanoid protocol droid designed to interact with organics, programmed primarily for etiquette and protocol. He was fluent in over six million forms of communication, and developed a fussy and worry-prone personality throughout his many decades of operation. After being destroyed and discarded on the planet Tatooine before 32 BBY, C-3PO was rebuilt; his salvaged nature gave him special qualities that distinguished him from similar droid models. Along with his counterpart, the astromech droid R2-D2, C-3PO constantly found himself directly involved in pivotal moments of galactic history, and aided in saving the galaxy on many occasions. C-3PO considered various droids and organics to be friends of his, and was very dedicated to them, as well as to any master that he served.",
		    "image": "http://vignette4.wikia.nocookie.net/starwars/images/5/51/C-3PO_EP3.png/revision/latest?cb=20131005124036"
		},
		{
			"name": "R2-D2", 
		    "height": "96", 
		    "mass": "32", 
		    "hair_color": "n/a", 
		    "skin_color": "white, blue", 
		    "eye_color": "red", 
		    "birth_year": "33BBY", 
		    "gender": "n/a", 
		    "homeworld": "Naboo",
		    "species": "Droid",
		    "description": "R2-D2, pronounced Artoo-Detoo and often referred to as Artoo, was an R2-series astromech droid manufactured by Industrial Automaton prior to 32 BBY. Resourceful and spunky, the droid developed an adventurous personality during his many decades of operation. Inside of his cylindrical frame were many arms, sensors, and other tools that could be extended to fulfill various needs, such as slicing computers, extinguishing fires, projecting holograms, repairing starships, and flying. Along with his counterpart, the protocol droid C-3PO, R2-D2 constantly found himself directly involved in pivotal moments of galactic history. His bravery, coupled with his many gadgets, played large roles in saving the galaxy time and time again. Like other astromech droids, R2-D2 could walk on two legs or use a third leg to roll across the ground.",
		    "image": "http://vignette4.wikia.nocookie.net/starwars/images/1/1a/R2d2.jpg/revision/latest?cb=20090524204255"
		},
		{
			"name": "Anakin Skywalker",
			"height": "188", 
		    "mass": "84", 
		    "hair_color": "blond", 
		    "skin_color": "fair", 
		    "eye_color": "blue", 
		    "birth_year": "41.9BBY", 
		    "gender": "male", 
		    "homeworld": "Tatooine",
		    "species": "Human",
		    "description": "Anakin Skywalker was a Force-sensitive Human male who served the Galactic Republic as a Jedi Knight and later served the Galactic Empire as the Sith Lord Darth Vader. Born to the slave Shmi Skywalker in 41.9 BBY, Anakin was conceived by midi-chlorians, the symbiotic organisms that allowed individuals to touch the Force, and he and his mother were brought to the desert planet of Tatooine to be the slaves of Gardulla the Hutt. They soon ended up as the property of the Toydarian Watto, and Skywalker exhibited exceptional piloting skills and a reputation for being able to build and repair anything even at a young age. In 32 BBY, Skywalker encountered the Jedi Qui-Gon Jinn and Padmé Amidala, and he helped them secure the parts they needed for their starship by winning the Boonta Eve Classic podracing event—only to learn that he had also won his freedom in doing so. Reluctantly leaving his mother behind, Skywalker accompanied Jinn and his group to the Republic's capital of Coruscant and participated in the Battle of Naboo, helping to free Amidala's homeworld from the armies of the Trade Federation. While Jinn was killed during the battle, Jinn's student Obi-Wan Kenobi followed Jinn's wishes and took on Skywalker as his Padawan, and much of the Jedi Council believed that Skywalker was the Chosen One of Jedi prophecy: one who would bring balance to the Force by destroying the Sith Order. Skywalker and Kenobi had a number of adventures during the Padawan's decade of training to become a Jedi, but as the Separatist Crisis threatened to tear the Republic apart in 22 BBY, Skywalker was reunited with Amidala when he was assigned to protect her from assassins. The two grew close during the course of the assignment, though they were caught up in the Battle of Geonosis and the beginning of the Clone Wars between the Republic and the Confederacy of Independent Systems. Losing an arm during the fighting, Skywalker received a cybernetic replacement, and he and Amidala were secretly married in the days after the battle despite the Jedi Code's restrictions on romantic attachments. During the Clone Wars, which raged for the next three years, Skywalker was granted the rank of Jedi Knight and became known to the public as the 'Hero with No Fear.' Taking on the Togruta Ahsoka Tano as his apprentice, Skywalker fought alongside Kenobi and his fellow Jedi in scores of battles, and his friendship with Supreme Chancellor Palpatine deepened despite the Jedi Order's wariness of Palpatine's rapid acquisition of further powers during the Clone Wars. Throughout the Clone Wars, Skywalker's anger and sense of loss pushed him ever closer to the dark side of the Force, and his visions of Amidala dying in childbirth in 19 BBY made him desperate to find a way to save his wife. Palpatine, who was in fact the Sith Lord Darth Sidious, manipulated Skywalker into becoming his apprentice with the promise of saving Amidala, and Skywalker became the Sith Lord Darth Vader as Palpatine transformed the Republic into the Galactic Empire and eradicated the Jedi Order. Vader and Kenobi clashed on Mustafar after Vader attacked his wife in the belief that she had betrayed him, and Vader was left limbless and ravaged by fire at the end of their battle. Encased in a suit of life-sustaining black armor and believing his wife to be dead, Vader embraced his role as the Emperor's right hand and enforcer, hunting down Jedi survivors and enforcing the will of the Empire for years to come. The Sith Lord trained a number of secret apprentices and Dark Jedi, though his plans to overthrow his master had not advanced far when the Galactic Civil War erupted between the Empire and the Alliance to Restore the Republic in 2 BBY. In 0 BBY, the Death Star—the Empire's greatest superweapon—was destroyed by a young Rebel pilot despite Vader's efforts, and Vader became obsessed with discovering the pilot's identity, only to learn that it was Luke Skywalker: his own son, born before Amidala's death. Vader continued to pursue both Skywalker and the Alliance over the next three years, finally luring his son into a trap on the mining colony of Cloud City in 3 ABY where the two dueled. Vader revealed his identity to Skywalker, though his son refused to join him and escaped. When Darth Sidious learned of Skywalker's existence, he set in motion his own plans to recruit Skywalker and thereby replace Vader, but Skywalker surrendered himself to Imperial forces on the forest moon of Endor in 4 ABY in hopes of redeeming his father and turning him back to the light side. In a final duel on the second Death Star as the Battle of Endor raged around them, Skywalker and Vader fought each other, and Vader refused his son's attempts to redeem him, learning that Skywalker had a twin sister named Leia in the process. Skywalker defeated his father but refused to kill him, and when Sidious attempted to kill the young man, Vader—moved by his son's love—abandoned the dark side and sacrificed himself to destroy the Emperor, fulfilling the prophecy of the Chosen One. Mortally wounded, Anakin made peace with his son and became one with the Force, though his reputation, his legacy, and his family endured for decades afterwards.",
		    "image": "http://vignette4.wikia.nocookie.net/starwars/images/6/6f/Anakin_Skywalker_RotS.png/revision/latest?cb=20130621175844"
		},
		{
			"name": "Leia Organa", 
		    "height": "150", 
		    "mass": "49", 
		    "hair_color": "brown", 
		    "skin_color": "light", 
		    "eye_color": "brown", 
		    "birth_year": "19BBY", 
		    "gender": "female", 
		    "homeworld": "Alderaan",
		    "species": "Human",
		    "description": "Leia Organa was a Force-sensitive human female who served as the princess of Alderaan, a member of the Imperial Senate, a leader in the Alliance to Restore the Republic and New Republic, and the founding general of the Resistance. Through it all, she became instrumental in the defeat of the Galactic Empire in the Galactic Civil War and led the fight against the First Order. She was born nineteen years before the Battle of Yavin as the daughter of Jedi Knight Anakin Skywalker and Senator Padmé Amidala. After her mother died and her father fell to the dark side of the Force to become Darth Vader, Leia was adopted by the House of Organa. She took the place of her adoptive father, Bail Organa, in the Senate and helped lead the fight against the Empire. During the war with the Empire, Organa was entrusted with the stolen plans to the Death Star, an Imperial superweapon capable of destroying entire planets. She also met and became friends with Luke Skywalker—who, unknown to either of them, was her twin brother—Han Solo, and Chewbacca, who helped her escape from captivity on the Death Star and return the stolen plans to the Rebellion. After the Death Star was destroyed during the Battle of Yavin, Organa continued to help lead the war effort and coordinate the operations of the Alliance. After the Battle of Hoth, Vader captured Organa and Solo on Cloud City to use them as bait to lure Skywalker there. Solo, with whom Organa had fallen in love, was captured by the bounty hunter Boba Fett, but the others managed to escape and rejoin the Alliance Fleet. Not long after, Organa aided in the successful rescue of Han Solo from Jabba the Hutt, after which she participated in the Battle of Endor as part of General Solo's team, with the objective of destroying the Death Star's shield generator. During the campaign, Organa learned that Vader was her father, and Skywalker her brother. Vader and the Emperor, Darth Sidious, perished during the battle.",
		    "image": "http://vignette4.wikia.nocookie.net/starwars/images/8/89/Leia_endorpromo02.jpg/revision/latest?cb=20080506155343"
		},
		{
			"name": "Owen Lars", 
		    "height": "178", 
		    "mass": "120", 
		    "hair_color": "brown, grey", 
		    "skin_color": "light", 
		    "eye_color": "blue", 
		    "birth_year": "52BBY", 
		    "gender": "male", 
		    "homeworld": "Tatooine", 
		    "species": "Human",
		    "description": "Owen Lars was the son of moisture farmer Cliegg Lars and the stepbrother of Anakin Skywalker. He married Beru Whitesun, and after his father's death, inherited his moisture farm. In 19 BBY, Beru convinced Owen to adopt Anakin's son, Luke Skywalker, as Anakin had turned to the dark side and become the infamous Darth Vader. Owen and Beru raised their nephew as well as they could, and Owen instilled into Luke the values of his own childhood. Fearful of Luke's potential, and distrustful of the outside galaxy, Owen attempted to keep Luke isolated and ignorant of his true parentage.",
		    "image": "http://vignette1.wikia.nocookie.net/starwars/images/9/91/OwenLarsHS-SWE.jpg/revision/latest?cb=20120428164235"
		},
		{
			"name": "Beru Whitesun Lars", 
		    "height": "165", 
		    "mass": "75", 
		    "hair_color": "brown", 
		    "skin_color": "light", 
		    "eye_color": "blue", 
		    "birth_year": "47BBY", 
		    "gender": "female", 
		    "homeworld": "Tatooine",
		    "species": "Human",
		    "description": "Beru Whitesun Lars, the wife of Owen Lars, was a Tatooinian woman who raised Luke Skywalker after the fall of the Galactic Republic. Coming from a long line of moisture farmers, Beru Whitesun grew up near Mos Eisley on Tatooine. On a trip to Anchorhead, she met Owen Lars, the son of another moisture farmer, Cliegg Lars. Beru and Owen fell in love, and Beru later became part of the Lars family. Shortly before the outbreak of the Clone Wars, Owen's stepmother, Shmi Skywalker Lars, was kidnapped by Tusken Raiders, an event that brought Shmi's son, Anakin Skywalker, and his soon-to-be-wife, Padmé Amidala, to the Lars homestead. Three years later, when the galactic conflict came to a close, Beru and Owen became the guardians of their new baby nephew, Luke Skywalker, after his father turned to the dark side of the Force and became Darth Vader. The Larses raised Skywalker like a son. Beru would often defend Skywalker's interests against Owen, who was overprotective of him out of fear that he would follow in Anakin's footsteps. Though Owen refused numerous times to let Skywalker go when he wished to leave home to attend the Imperial Academy with his friend Biggs Darklighter, Beru convinced her husband to let Skywalker go after staying on for only one more season. After a year had passed, Beru tried to convince Owen that it was time to let Skywalker move on, but they never had time to reach an agreement. The two were killed by Imperial stormtroopers, by order of Darth Vader, who were searching for a droid carrying the stolen Death Star plans.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/7/76/Beru_headshot2.jpg/revision/latest?cb=20111029215429"
		},
		{
			"name": "R5-D4", 
		    "height": "97", 
		    "mass": "32", 
		    "hair_color": "n/a", 
		    "skin_color": "white, red", 
		    "eye_color": "red", 
		    "birth_year": "unknown", 
		    "gender": "n/a", 
		    "homeworld": "Tatooine",
		    "species": "Droid",
		    "description": "R5-D4, also called 'Red' by Luke Skywalker, was a red and white-striped R5 line astromech droid owned by a group of Jawas on Tatooine in the early days of the Galactic Civil War. Shortly before the Battle of Yavin, the Jawas attempted to sell him to Owen Lars, but the droid's motivator malfunctioned, so he purchased R2-D2 in R5-D4's place.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/2/2c/R5d4.jpg/revision/latest?cb=20080404200713"
		},
		{
			"name": "Biggs Darklighter", 
		    "height": "183", 
		    "mass": "84", 
		    "hair_color": "black", 
		    "skin_color": "light", 
		    "eye_color": "brown", 
		    "birth_year": "24BBY", 
		    "gender": "male", 
		    "homeworld": "Tatooine",
		    "species": "Human", 
		    "description": "Biggs Darklighter was a Human male starfighter pilot who served the Alliance to Restore the Republic and a childhood friend of Luke Skywalker during the time of the Galactic Civil War. Darklighter flew a T-65 X-wing starfighter with Red Squadron during the Battle of Yavin as Red Three, where he perished.",
		    "image": "http://vignette3.wikia.nocookie.net/starwars/images/0/00/BiggsHS-ANH.png/revision/latest?cb=20130305010406"
		},
		{
			"name": "Obi-Wan Kenobi", 
		    "height": "182", 
		    "mass": "77", 
		    "hair_color": "auburn, white", 
		    "skin_color": "fair", 
		    "eye_color": "blue-gray", 
		    "birth_year": "57BBY", 
		    "gender": "male", 
		    "homeworld": "Stewjon", 
		    "species": "Human", 
		    "description": "Obi-Wan Kenobi, later known as Ben Kenobi during his exile, was a Force-sensitive human male Jedi Master who served the Galactic Republic. He was mentor to both Anakin Skywalker and his son, Luke, training them in the ways of the Force. Born on the planet Stewjon, Kenobi was taken as the Padawan learner of Qui-Gon Jinn. During the Invasion of Naboo, Kenobi became the first Jedi in a millennium to defeat a Sith Lord when he defeated Darth Maul during the Battle of Naboo, but in that battle, Maul mortally wounded Jinn. At Jinn's behest, Kenobi took Anakin Skywalker to be his own Padawan, training him during the decade leading up to the Clone Wars. During the Clone Wars, Skywalker was made a Jedi Knight, and Kenobi and Skywalker fought alongside each other as generals many times. In the last days of the Clone Wars, Skywalker turned to the dark side, betraying the Jedi. Skywalker's new Sith Master, Supreme Chancellor Palpatine, used Order 66 to destroy the Jedi Order, though Kenobi survived and reunited with another survivor, Yoda. Kenobi confronted Skywalker, who had now taken the name Darth Vader, on Mustafar, and the two dueled. Kenobi emerged the victor, gravely wounding Vader and remorsefully leaving him for dead. Kenobi then went into exile on Tatooine, taking Vader's newborn son, Luke Skywalker, to live on the planet with his aunt and uncle, Beru and Owen Lars. Palpatine established the Galactic Empire in place of the Galactic Republic and Vader was rehabilitated, though he was forced to rely on a cybernetic suit for life support. Nineteen years later, Kenobi received a message via R2-D2 from Leia Organa asking for help in the Rebel Alliance's fight against the Empire. The droid contained the plans to the Death Star, a battle station created by the Empire capable of destroying planets, and the plans needed to be taken to Bail Organa on Alderaan. After Luke Skywalker's aunt and uncle were killed by Imperial forces searching for the plans, Skywalker agreed to join Kenobi on this mission and be trained as a Jedi. The pair were taken to Alderaan by Han Solo, only for them to discover that the planet had been destroyed by the Death Star. Their ship, the Millennium Falcon, was captured by the Death Star's tractor beam, and Kenobi was confronted by Darth Vader. Vader and Kenobi dueled again, and Kenobi allowed Vader to kill him so that Luke and his companions could escape the Death Star. In the following years, as Luke continued fighting for the Rebel Alliance, Kenobi continued to give him guidance as a Force spirit, including directing Luke to the planet Dagobah, where Luke received training from his own Master, Yoda.",
		    "image": "http://vignette4.wikia.nocookie.net/starwars/images/4/4e/ObiWanHS-SWE.jpg/revision/latest?cb=20111115052816"
		}, 
		{
			"name": "Wilhuff Tarkin", 
		    "height": "180", 
		    "mass": "unknown", 
		    "hair_color": "auburn, grey", 
		    "skin_color": "fair", 
		    "eye_color": "blue", 
		    "birth_year": "64BBY", 
		    "gender": "male", 
		    "homeworld": "Eriadu", 
		    "species": "Human",
		    "description": "Wilhuff Tarkin was a Human male who was one of the most powerful individuals in the Galactic Empire, a Grand Moff who shaped Imperial doctrine and was the driving force behind the creation of its key embodiment, the Death Star. Born on Eriadu to the powerful and militaristic Human Tarkin family, the ambitious Tarkin began his career by serving in the Republic Outland Regions Security Force. He then retired and entered politics, becoming lieutenant governor of Eriadu and the Seswenna sector, before returning to the military in order to serve Supreme Chancellor Palpatine as an agent of the secret Sith Lord's New Order movement. It was in that time that Tarkin learned of his friend Raith Sienar's designs for the Expeditionary Battle Planetoid and, convinced of the potential of the design, presented Palpatine with the plans for what would become the Death Star.",
		    "image": "http://vignette1.wikia.nocookie.net/starwars/images/c/c1/Tarkininfobox.jpg/revision/latest?cb=20100620213033"
		},
		{
			"name": "Chewbacca", 
		    "height": "228", 
		    "mass": "112", 
		    "hair_color": "brown", 
		    "skin_color": "unknown", 
		    "eye_color": "blue", 
		    "birth_year": "200BBY", 
		    "gender": "male", 
		    "homeworld": "Kashyyyk", 
		    "species": "Wookiee", 
		    "description": "Chewbacca (or 'Chewie', as he was known by his friends) was a legendary Wookiee from Kashyyyk and co-pilot of Han Solo's ship, the Millennium Falcon. He was considered a hero of the Rebel Alliance and played a role in key victories against the Galactic Empire. He was the son of Attichitcuk, the husband of Mallatobuck, and the father of Lumpawaroo. Chewbacca carried with him the name of an ancient Wookiee hero, the great Bacca, first of the great chieftains of Kashyyyk, and the creator of a sword that denoted leadership among the Wookiees. This name placed Chewbacca in a noble lineage, which was further supported by his role in the Battle of Kashyyyk during the Clone Wars and during the Galactic Civil War. Chewbacca was a wise, sophisticated being of great strength and loyalty. As technologically savvy as the brightest Academy graduate, he was also a skilled mechanic. Chewbacca, like many Wookiees, was able to understand Basic, but he could not speak it due to his species's vocal structure. He instead spoke Shyriiwook, the main Wookiee language, composed largely of growls and grunts, to his non-Wookiee companions who typically replied in Basic.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/e/ec/ChewbaccaCSWE.jpg/revision/latest?cb=20130702064257"
		},
		{
			"name": "Han Solo", 
		    "height": "180", 
		    "mass": "80", 
		    "hair_color": "brown", 
		    "skin_color": "fair", 
		    "eye_color": "brown", 
		    "birth_year": "29BBY", 
		    "gender": "male", 
		    "homeworld": "Corellia", 
		    "species": "Human", 
		    "description": "Han Solo was a male Human smuggler from the manufacturing planet Corellia who achieved galactic fame as a member of the Rebel Alliance and later the New Republic. Born on Corellia, he was orphaned at an early age and taken by the pirate Garris Shrike to serve on his crew. He was treated cruelly, and served Shrike for many years before escaping while in his teens. Solo became a smuggler, and fell in love with Bria Tharen, though she left him due to her duties to the Rebel Alliance. Solo then entered the Imperial Academy at Carida, serving with distinction. He was kicked out, however, when he stopped an Imperial officer from beating a Wookiee named Chewbacca with a neuronic whip for resisting capture. In gratitude, the Wookiee swore a life debt to Solo, protecting him with his life and a bond of friendship formed between the two that was unbreakable. Solo became a smuggler once again, with Chewbacca at his side. Piloting the upgraded and customized the Millennium Falcon, which he won in a game of Sabacc against Lando Calrissian, his future ally, he became known as one of the best smugglers in the galaxy.",
		    "image": "http://vignette3.wikia.nocookie.net/starwars/images/0/01/Hansoloprofile.jpg/revision/latest?cb=20100129155042"
		},
		{
			"name": "Greedo", 
		    "height": "173", 
		    "mass": "74", 
		    "hair_color": "n/a", 
		    "skin_color": "green", 
		    "eye_color": "black", 
		    "birth_year": "44BBY", 
		    "gender": "male", 
		    "homeworld": "Rodia",
		    "species": "Rodian", 
		    "description": "Greedo was a male Rodian bounty hunter who grew up on Tatooine in Mos Espa. During the Clone Wars, he was hired by the Trade Federation to kidnap Chi Eekway and Che Amanwe Papanoida, the daughters of Chairman Papanoida, but was forced by the chairman to lead him and his son Ion to them. He was occasionally hired by crimelord Jabba the Hutt for various mercenary jobs, including the capture of Han Solo, who killed the luckless Rodian.",
		    "image": "http://vignette4.wikia.nocookie.net/starwars/images/c/c6/Greedo.jpg/revision/latest?cb=20111104205225"
		},
		{
			"name": "Jabba Desilijic Tiure", 
		    "height": "175", 
		    "mass": "1,358", 
		    "hair_color": "n/a", 
		    "skin_color": "green-tan, brown", 
		    "eye_color": "orange", 
		    "birth_year": "600BBY", 
		    "gender": "hermaphrodite", 
		    "homeworld": "Nal Hutta",
		    "species": "Hutt", 
		    "description": "Jabba Desilijic Tiure, more commonly referred to as Jabba the Hutt, was a Hutt gangster and crime lord, as well as a member of the Grand Hutt Council, who operated from his palace on the Outer Rim world of Tatooine. Jabba was a major figure on Tatooine, where he controlled the bulk of the trafficking in illegal goods, piracy and slavery that generated most of the planet's wealth. He was also highly influential in the entire Outer Rim as one of its most powerful crime lords. During the Clone Wars, Jabba's influence and power over the Outer Rim, specifically its hyperlanes, was sought by both the Galactic Republic and the Confederacy of Independent Systems, who both courted Jabba's approval. When Rotta, Jabba's son, was kidnapped, the crime lord promised his support to whomever returned his son. When the Separatists were revealed to have orchastrated Rotta's kidnapping, Jabba pledged his support to the Republic. Jabba continued to operate in the Outer Rim after the end of the Clone Wars and the rise of the Galactic Empire, preserving his power base, despite the interference of Darth Sidious, the Galactic Emperor. After the destruction of the Death Star by the Rebel Alliance, the Emperor sent Darth Vader to negotiate a deal with Jabba to secure raw materials for Imperial Military production. Jabba's alliance with the Empire allowed him and the Hutts to survive the Imperial crackdown against criminal elements in the Outer Rim, as well as rid the Hutt of his competitors. After the smuggler Han Solo failed to repay him for lost cargo, Jabba placed a high price on his head. Solo was eventually delivered to him by one of his bounty hunters, Boba Fett, as a gift from Darth Vader. However, this capture brought him to the attention of Jedi Knight Luke Skywalker, who sought to rescue his friend from Jabba's imprisonment. As he attempted to execute the Jedi and his allies in the Great Pit of Carkoon, Jabba was killed by Leia Organa.",
		    "image": "http://vignette3.wikia.nocookie.net/starwars/images/7/7f/Jabba_SWSB.png/revision/latest?cb=20100915194254"
		},
		{
			"name": "Wedge Antilles", 
		    "height": "170", 
		    "mass": "77", 
		    "hair_color": "brown", 
		    "skin_color": "fair", 
		    "eye_color": "hazel", 
		    "birth_year": "21BBY", 
		    "gender": "male", 
		    "homeworld": "Corellia",
		    "species": "Human", 
		    "description": "Wedge Antilles, a Human male, was a famed Corellian pilot and general, known as a hero of the Rebel Alliance and New Republic. Orphaned at age seventeen, he joined the Rebellion after Imperial forces killed his girlfriend, Mala Tinero. A standout starfighter pilot, he was one of the few to survive the Battle of Yavin, after which he founded Rogue Squadron with his friend Luke Skywalker. Antilles and Skywalker built Rogue Squadron into a renowned unit, and after the Battle of Hoth, Antilles took command. He flew as Red Leader in the Battle of Endor, striking the blow that destroyed the second Death Star alongside Lando Calrissian and becoming the only pilot to survive both Death Star runs.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/6/60/WedgeHelmetless-ROTJHD.jpg/revision/latest?cb=20110916160227",
		},
		{
			"name": "Jek Tono Porkins", 
		    "height": "180", 
		    "mass": "110", 
		    "hair_color": "brown", 
		    "skin_color": "fair", 
		    "eye_color": "blue", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Bestine IV",
		    "species": "Human", 
		    "description": "Jek Tono Porkins was a trader and pilot from Bestine IV who, along with the other Bestines, was forced to abandon his homeworld when the Galactic Empire chose it as the site of a new military base. Seeking the opportunity to strike back at the Empire, Porkins joined the Alliance to Restore the Republic and was assigned to Tierfon Rebel Outpost for pilot training with the Tierfon Yellow Aces. His skill at low-altitude strafing runs and his rotund physique earned him the nicknames 'Belly Runner' and 'Piggy.' After the completion of the Empire's Death Star, the Yellow Aces were taken to fully active status and transferred to fill gaps in pilot rosters at other Rebel bases. When Porkins's good friend Wes Janson was taken ill with a case of Hesken Fever, Porkins was given his friend's assignment instead and transferred to Red Squadron, operating out of the Great Temple on Yavin 4. Porkins soon took part in his first missions with Red Squadron, working with Biggs Darklighter, Wedge Antilles, and Cesi Eirriss to help retrieve a number of astromech droids from the smuggler Nera Dantels on Commenor. The group returned to Yavin 4 just before the arrival of the Death Star in the Yavin system, on a mission to destroy the Rebel base. Porkins flew as Red Six during the Battle of Yavin, his skills at strafing aiding the Rebels early in the battle. However, when his T-65 X-wing starfighter was struck by debris, leaving him with several mechanical and computer malfunctions, Porkins was hit by enemy turbolaser fire and killed.",
		    "image": "http://vignette4.wikia.nocookie.net/starwars/images/5/53/Porkins.jpg/revision/latest?cb=20111104223725"
		},
		{
			"name": "Yoda", 
		    "height": "66", 
		    "mass": "17", 
		    "hair_color": "white", 
		    "skin_color": "green", 
		    "eye_color": "brown", 
		    "birth_year": "896BBY", 
		    "gender": "male", 
		    "homeworld": "unknown", 
		    "species": "Yoda's species", 
		    "description": "Yoda was one of the most renowned and powerful Jedi Masters in galactic history. He was known for his legendary wisdom, mastery of the Force and skills in lightsaber combat. Yoda served as a member of the Jedi High Council in the last centuries of the Galactic Republic and as Grand Master oversaw the Jedi Order before, during, and after the devastating Clone Wars. Following the First Battle of Geonosis, Yoda held the title of Master of the Order in addition to that of Grand Master. In his centuries of service to the galaxy and the Force, Grand Master Yoda had a hand in the training of nearly all the Jedi in the Order, including such luminaries as Obi-Wan Kenobi, Ki-Adi-Mundi and Oppo Rancisis; all of whom would come to serve on the Jedi Council along with him. Standing at about 66 cm tall, Yoda was a male member of a mysterious species, details of which he did not reveal. Yoda served as a member of the Jedi Order for centuries, eventually gaining a seat on the Jedi High Council, before reigning as the Grand Master of the Jedi. He had exceptional skills in lightsaber combat, most commonly employing whirling and acrobatic Form IV techniques. Yoda was a master of all but the Vaapad subset of Form VII (he had mastered the original Form VII variant known as Juyo) of lightsaber combat, and was considered by many as a swordmaster. Though arguably the Order's greatest master of the Force and most skilled warrior, Yoda believed most firmly in the importance of instructing younger generations and never missed an opportunity to ensure his students learn from their experiences. At heart, the diminutive Jedi Master was a teacher; indeed, he instructed nearly all the Jedi in the order, to some extent, during his reign as Grand Master. Though Yoda was, arguably, the most highly Force-attuned member of the Order, he was not flawless. It was partially due to his failure to recognize that Supreme Chancellor Palpatine was actually responsible for the outbreak of the Clone Wars, and was in fact the Sith Lord Darth Sidious, which led to the Republic being overthrown and the Jedi Order being decimated. The Grand Master was among the few Jedi to survive Emperor Palpatine's Great Jedi Purge, after the beginning of which, he went into exile on the swamp planet of Dagobah. Later, before dying and becoming one with the Force in 4 ABY, the exiled Jedi Master was responsible for the instruction of Luke Skywalker who would use Yoda's training as a basis for the creation of a New Jedi Order, after defeating the Sith. Following his death, Master Yoda retained his identity within the Force and was revered as among the most legendary Jedi Masters of all time by Skywalker's reconstituted Order.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/d/d6/Yoda_SWSB.png/revision/latest?cb=20150206140125"
		},
		{
			"name": "Palpatine", 
		    "height": "170", 
		    "mass": "75", 
		    "hair_color": "grey", 
		    "skin_color": "pale", 
		    "eye_color": "yellow", 
		    "birth_year": "82BBY", 
		    "gender": "male", 
		    "homeworld": "Naboo",
		    "species": "Human", 
		    "description": "Palpatine, also known as Darth Sidious, was a Force-sensitive Human male who served as the last Supreme Chancellor of the Galactic Republic and the first Emperor of the Galactic Empire. A Dark Lord of the Sith in the Order of the Sith Lords, recorded by history as the most powerful who had ever lived, his entire life was the culmination of a thousand-year plan to overthrow the Republic and the Jedi Order from within. Born in 82 BBY on the planet Naboo to the aristocratic House Palpatine, Palpatine discovered the Sith at a young age as a collector of dark side artifacts. In 65 BBY, he met Hego Damask, a Muun businessman who was in reality the Sith Lord Darth Plagueis. Under Plagueis's manipulation, Palpatine killed his father and pledged himself to his new Master's dark side teachings as Darth Sidious. Palpatine lived a double life for many years, serving an untarnished career as Naboo's ambassador in the Galactic Senate while learning from his master and training a young Zabrak as the Sith assassin Darth Maul. Plagueis and Sidious, both exceptionally skilled and powerful in the Force, were able to conceal their identities from the Jedi for decades. As Plagueis privately searched for the key to eternal life, Sidious manipulated galactic politics, culminating in the blockade of Naboo by the Trade Federation. In the wake of the political crisis, the Galactic Senate voted to elect him as Supreme Chancellor, and around the same time, in accordance with Bane's Rule of Two, Palpatine murdered Plagueis and usurped the role of Sith Master. As Chancellor of the Republic and Dark Lord of the Sith, Palpatine orchestrated the outbreak of the devastating Clone Wars ten years after the Naboo Crisis. He himself headed both the Galactic Republic and, secretly, the Confederacy of Independent Systems. The public leader of this splinter faction was former Jedi Master Count Dooku, Sidious' second apprentice as Darth Tyranus in the wake of Maul's presumed death on Naboo. As billions perished in the war, the vast majority of Republic citizens rallied behind Chancellor Palpatine, giving him enough support to amend the Galactic Constitution in the name of security and transfer most of the Senate's executive authority to his own office. In 19 BBY, following Tyranus's demise, Palpatine revealed his identity as Darth Sidious to the Jedi Knight Anakin Skywalker, telling that the dark side teachings that Plagueis had pursued could help Skywalker to save his wife, whom Skywalker had foreseen dying untimely. A failed attempt by the Jedi High Council to arrest Palpatine ensued, and Skywalker pledged himself to Sidious's teachings as Darth Vader. All members of the Jedi Order were accused of treason and betrayed by their clone troopers to the point of virtual extermination. Without the Jedi to oppose him, Palpatine declared himself Emperor of the first Galactic Empire, bringing an end to the Republic that had stood for over 25,000 years. As Emperor, Palpatine effectively wielded absolute control over the entire galaxy and virtually everyone who lived within it. During his tenure, he built one of the most powerful military forces the galaxy had ever seen and ruled unopposed for nearly two decades. Palpatine progressively abandoned his facade of being an enlightened leader and began to rule through terror symbolized by the Death Star, a superweapon that could annihilate entire planets. However, he later discovered that Vader was training Galen Marek, an exceptionally powerful Force adept as a secret apprentice 'Starkiller'. When Palpatine discovered Starkiller's existence in 3 BBY, he forced Vader to fake Starkiller's death and then request that Starkiller assemble the most influential traitors in the Empire in a rebellion in order to highlight and destroy them all. Palpatine's plan backfired when Starkiller, healed from his near-fatal injuries and espousing the teachings of the light side, vowed revenge against Palpatine and confronted him on the Death Star, ultimately sacrificing himself in an act that inspired the dissident senators to create the Alliance to Restore the Republic. As the Galactic Civil War broke out, Emperor Palpatine ironically fought against a rebellion that he started in secret. After the Empire suffered a devastating defeat in 0 BBY, in which the Alliance destroyed the Death Star, the Emperor steadily began to lose his absolute control over the galaxy. In 4 ABY, Palpatine gambled his chances in order to annihilate the Rebel Alliance once and for all, allowing Rebel spies to learn of the existence of a second Death Star and its secret location near Endor. As expected, the Alliance fell for the bait and dispatched its fleet to destroy the Emperor, Vader, and the incomplete Death Star. With the Alliance soon falling for his trap, Palpatine brought Luke Skywalker, the son of Darth Vader, before him in order to turn him over to the dark side and replace Vader with an apprentice who was younger and more powerful. After goading Skywalker to give into his frustrations with thoughts of the Alliance's defeat and the death of his friends, Palpatine eagerly watched as father and son fought one another. However, Skywalker refused to submit to the dark side and spared his father, prompting Palpatine to unleash all of his rage and hatred on Skywalker. Unwilling to stand by and watch his son die from the agonizing effects of Palpatine's Force lightning, Vader finally redeemed himself, throwing his astonished Master down the Death Star's shaft, a sacrifice that fulfilled the prophecy of the Chosen One and brought about the end of the Order of the Sith Lords.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/d/d8/Emperor_Sidious.png/revision/latest?cb=20130620100935"
		},
		{
			"name": "Boba Fett", 
		    "height": "183", 
		    "mass": "78.2", 
		    "hair_color": "black", 
		    "skin_color": "fair", 
		    "eye_color": "brown", 
		    "birth_year": "31.5BBY", 
		    "gender": "male", 
		    "homeworld": "Kamino", 
		    "species": "Human", 
		    "description": "Boba Fett was a Mandalorian warrior and bounty hunter. He was the only unaltered clone of the famed Jango Fett, created in 32 BBY as unit A0050, one of the first of many Fett replicas designed to become part of the Grand Army of the Republic, and was raised as Jango's son. Jango taught Boba much, training him to become a skilled bounty hunter as was his father-figure before him. In 22 BBY, Jango was killed at the Battle of Geonosis, which opened the Clone Wars. Just a boy, Boba was forced to grow up and took to traveling the galaxy. Later, he became a bounty hunter and took assignments from beings such as Jabba the Hutt, and achieved notoriety despite his young age. When the Empire was formed in 19 BBY, it was the perfect environment for Fett. During this time, he also married Sintas Vel and had a daughter named Ailyn Vel. Fett became known as the galaxy's best bounty hunter of the next several decades, often working for the Empire. He collaborated with Darth Vader on several occasions, and the Sith Lord even developed a grudging respect for Fett. In 1 BBY, a year after the Galactic Civil War had begun, Fett was hired to kidnap the Rebel captain Juno Eclipse in order to lure out a clone of Galen Marek. Fett participated in the Battle of Kamino and when Darth Vader was captured and about to be interrogated on Dantooine, the Mandalorian bounty hunter trailed the Rogue Shadow there. Fett made his most notable bounty in 3 ABY, when he captured Rebel hero Han Solo, and delivered him to Jabba the Hutt. A year later, during the Battle of the Great Pit of Carkoon, Fett fought against the group of Rebel rescuers. However, he was inadvertently knocked into the mouth of the Sarlacc by Solo. Though no one in recorded history had ever escaped from the Sarlacc, Fett was able to escape, though not unscathed. Thanks to his iron will and Mandalorian armor, he was able to fight his way out of the beast's belly. Back in action, he resumed his work as a bounty hunter.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/5/58/BobaFettMain2.jpg/revision/latest?cb=20130920001614"
		},
		{
			"name": "IG-88", 
		    "height": "200", 
		    "mass": "140", 
		    "hair_color": "none", 
		    "skin_color": "metal", 
		    "eye_color": "red", 
		    "birth_year": "15BBY", 
		    "gender": "none", 
		    "homeworld": "unknown",
		    "species": "Droid",
		    "description": "IG-88 was a rogue masculine IG-86 sentinel droid who worked as a bounty hunter. Following the Battle of Hoth, he and several other bounty hunters were summoned by Darth Vader to the Executor and hired to track down the Millennium Falcon and her Rebel crew, though it was ultimately IG-88's chief rival, Boba Fett, who collected the bounty after pursuing the Falcon to Bespin.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/a/aa/IG-88B-ESB.jpg/revision/latest?cb=20151130035541"
		},
		{
			"name": "Bossk", 
		    "height": "190", 
		    "mass": "113", 
		    "hair_color": "none", 
		    "skin_color": "green", 
		    "eye_color": "red", 
		    "birth_year": "53BBY", 
		    "gender": "male", 
		    "homeworld": "Trandosha", 
		    "species": "Trandoshan", 
		    "description": "Bossk was a male Trandoshan bounty hunter and the son of Cradossk who was known for hunting Wookiees. During the Clone Wars, Bossk worked alongside fellow hunters Aurra Sing and Castas to mentor the orphaned Boba Fett. Their scheme to kill Fett's hated enemy Mace Windu resulted in Fett and Bossk's arrest. After a stint in prison, Bossk worked in Fett's syndicate of bounty hunters, taking jobs for clients including Otua Blank and Asajj Ventress. After the rise of the Empire, Bossk traveled to the Outer Rim planet of Lothal to collect a bounty on the Dug criminal Gronson Takkaro, who had jumped bail in the Ahakista system. During his Lothal trip, Bossk also joined forces with the Force-sensitive street urchin Ezra Bridger to stop the corrupt Imperial Security Bureau Lieutenant Jenkes. Following the Battle of Hoth, Bossk would be called upon by Darth Vader to find and capture the Millennium Falcon.",
		    "image": "http://vignette1.wikia.nocookie.net/starwars/images/1/1d/Bossk.png/revision/latest?cb=20130219044712"
		},
		{
			"name": "Lando Calrissian", 
		    "height": "177", 
		    "mass": "79", 
		    "hair_color": "black", 
		    "skin_color": "dark", 
		    "eye_color": "brown", 
		    "birth_year": "31BBY", 
		    "gender": "male", 
		    "homeworld": "Socorro", 
		    "species": "Human", 
		    "description": "Lando Calrissian was a Human male professional gambler, entrepreneur, smuggler, and general throughout various points in his life. Born on Socorro, he became a gambler and con man early in his life and acquired his own ship, the Millennium Falcon, in a game of sabacc with a man named Cix Trouvee. He went on to have numerous adventures with the Falcon and its piloting droid, Vuffi Raa, during which he ran afoul of a Sorcerer of Tund named Rokur Gepta, whom Calrissian eventually killed. After a series of events led to him losing the Millennium Falcon to a Corellian named Han Solo on Bespin, Calrissian eventually became the Baron Administrator of Cloud City for a time—a position he once again gained through sabacc. In 3 ABY, Cloud City was taken over by the Galactic Empire during the Galactic Civil War as part of a deal gone wrong. Calrissian had previously agreed to turn over a group of Rebels to the Empire, including Han Solo and Leia Organa, as part of bait for a trap for Jedi Luke Skywalker. However, Darth Vader altered the deal to the point where Calrissian felt he was no longer able to tolerate it. Subsequently, he joined the Rebel Alliance and took part in numerous missions on its behalf; in particular, in search for Han Solo, who had been frozen in carbonite due to Calrissian's betrayal on Bespin. Calrissian eventually participated in Solo's rescue and the defeat of Jabba the Hutt. Following Solo's rescue, Calrissian continued to serve with the Alliance and during the Battle of Endor in 4 ABY, Calrissian piloted his old ship, the Millennium Falcon, into the second Death Star's core to destroy its reactor.",
		    "image": "http://vignette1.wikia.nocookie.net/starwars/images/7/7d/Lando_WoSW.jpg/revision/latest?cb=20080715214753"
		},
		{
			"name": "Lobot", 
		    "height": "175", 
		    "mass": "79", 
		    "hair_color": "none", 
		    "skin_color": "light", 
		    "eye_color": "blue", 
		    "birth_year": "37BBY", 
		    "gender": "male", 
		    "homeworld": "Bespin", 
		    "species": "Human", 
		    "description": "Lobot, also known by the nickname Lo, was a male human from the planet Bespin who, with the assistance of his AJ^6 cyborg construct, was paid to run battlefield calculations for the Galactic Empire. However, he eventually began working with the smuggler Lando Calrissian aboard the Millennium Falcon, running numerous criminal jobs. During one job, the theft of the Emperor's personal yacht, Lobot was gravely wounded by an Imperial Guard. In his injured state, Lobot's mind was lost and his cybernetic implants took over. In the time to come, Calrissian became Baron Administrator of Cloud City on Lobot's homeworld of Bespin, and Lobot served as his aide. As the city's computer-liaison officer, his implants enabled him to communicate with the city's central network. During the Empire's takeover of Cloud City, Lando ordered Lobot to gather their security forces to outflank the stormtroopers. Although they successfully helped evacuate the city by rounding up the stormtroopers, the city soon fell to the Empire and Lobot was captured. Following the Empire's defeat at the Battle of Endor, Imperial Governor Adelhard tightened his grip on the Anoat sector, home to Bespin, forming the Iron Blockade. Receiving support from the New Republic, Lobot fought to liberate his homeworld.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/9/96/SWE_Lobot.jpg/revision/latest?cb=20160123060717"
		},
		{
			"name": "Gial Ackbar", 
		    "height": "180", 
		    "mass": "83", 
		    "hair_color": "none", 
		    "skin_color": "brown mottle", 
		    "eye_color": "orange", 
		    "birth_year": "41BBY", 
		    "gender": "male", 
		    "homeworld": "Mon Cala",
		    "species": "Mon Calamari", 
		    "description": "Gial Ackbar was a male Mon Calamari who became the foremost military commander of the Alliance to Restore the Republic and its successor government the New Republic. During the Clone Wars, he was in charge of the Mon Calamari Guard and fought in the battle that had secured Prince Lee-Char's way to the throne as King of Dac. Having previously been an Imperial slave to Grand Moff Wilhuff Tarkin, he was freed by Captain Juno Eclipse and was recruited to join the Rebellion. Later, he fought alongside Renegade Squadron and was once captured by bounty hunter Boba Fett. During the Battle of Endor, later revealed to be a trap for him and the Alliance, he led Alliance naval forces against the Death Star II. He held the distinction of having been the Supreme Commander of the New Republic Defense Force for nearly two decades and defeating two Imperial Grand Admirals, Osvald Teshik and Peccati Syn, along with numerous other threats. He wrote the manual for the New Republic Fleet Academy, titled Fleet Tactics and Combat Methodology.",
		    "image": "http://vignette1.wikia.nocookie.net/starwars/images/f/fb/Ackbar_HS.jpg/revision/latest?cb=20081118162020"
		},
		{
			"name": "Mon Mothma", 
		    "height": "150", 
		    "mass": "unknown", 
		    "hair_color": "auburn", 
		    "skin_color": "fair", 
		    "eye_color": "blue", 
		    "birth_year": "48BBY", 
		    "gender": "female", 
		    "homeworld": "Chandrila",
		    "species": "Human", 
		    "description": "Mon Mothma, a native of Chandrila, was a female Human who served as an important political figure from the waning days of the Galactic Republic, one of the founders of the Alliance to Restore the Republic, and the first Chief of State of the New Republic. When the foundation of the Galactic Empire replaced the Republic that had existed for many millennia, she met with her allies in the Senate, such as Senators Padmé Amidala and Bail Prestor Organa. In 2 BBY, she signed the Corellian Treaty, along with Organa, Garm Bel Iblis, Rahm Kota, and Galen Marek, in order to form the Alliance to Restore the Republic. She, along with the others, were taken captive aboard the Death Star I, although they were rescued. She played an important role in the ensuing Galactic Civil War, and after the decisive Rebel victory at the Battle of Endor, she became the first Chief of State of the newly founded New Republic. She also had a daughter, Lieda, and a son, Jobin. In 24 ABY, she passed away peacefully on Chandrila.",
		    "image": "http://vignette3.wikia.nocookie.net/starwars/images/4/46/Monmothma.jpg/revision/latest?cb=20070615234013"
		},
		{
			"name": "Arvel Crynyd", 
		    "height": "unknown", 
		    "mass": "unknown", 
		    "hair_color": "brown", 
		    "skin_color": "fair", 
		    "eye_color": "brown", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "unknown", 
		    "species": "Human", 
		    "description": "Arvel Crynyd was a human male starfighter pilot that flew for the Alliance to Restore the Republic during the Galactic Civil War. During the Battle of Endor, He flew as Green Leader and was in command of the all A-wing starfighter-filled Green Squadron. He died when he flew his A-wing into the bridge of the Super Star Destroyer Executor, destroying the bridge and causing the Executor to crash into the Death Star. Following his death, Lieutenant L'ulo became the acting group commander of Green Squadron.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/d/de/Arvel-crynyd.jpg/revision/latest?cb=20120113223349"
		},
		{
			"name": "Wicket Systri Warrick", 
		    "height": "88", 
		    "mass": "20", 
		    "hair_color": "brown", 
		    "skin_color": "brown", 
		    "eye_color": "brown", 
		    "birth_year": "8BBY", 
		    "gender": "male", 
		    "homeworld": "Endor", 
		    "species": "Ewok", 
		    "description": "Wicket Wystri Warrick was a male Ewok scout, warrior and later Chief of Bright Tree Village on the forest moon of Endor. The great-grandson of Erpham Warrick, Wicket was the third son of Deej and Shodu Warrick, following Weechee and Willy and was the older brother of Winda. Wicket led an adventurous life, even from a very young age. He and his friends, namely Teebo and Princess Kneesaa, continually protected their village and the surrounding forest from those who would do them harm, such as Morag the Tulgah witch, the Duloks, and other threats from Endor and beyond. He almost even inadvertently killed Emperor Palpatine while defending the sunstar during Doctor Raygar's quest for Imperial domination. Wicket aided the Towani family when they crash-landed on Endor and later assisted Noa Briqualon in the battle against the Sanyassans. Wicket also played an instrumental role in helping the Rebel Alliance defeat the Galactic Empire during the Battle of Endor. After the death of Chief Chirpa, Wicket and his bride, Kneesaa, ruled over Bright Tree Village together.",
		    "image": "http://vignette4.wikia.nocookie.net/starwars/images/4/4f/Wicket_RotJ.png/revision/latest?cb=20130622101905"
		},
		{
			"name": "Nien Nunb", 
		    "height": "160", 
		    "mass": "68", 
		    "hair_color": "none", 
		    "skin_color": "grey", 
		    "eye_color": "black", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Sullust", 
		    "species": "Sullustan", 
		    "description": "Nien Nunb was a Sullustan male arms dealer and smuggler who joined the Alliance to Restore the Republic during the Galactic Civil War. Shortly after the Battle of Yavin, Nunb answered the call from his friend, Rebel pilot Evaan Verlaine, to help smuggle a group of Alderaanians off of Sullust while avoiding detection from the Galactic Empire; the Empire was searching for surviving Alderaanians after the destruction of Alderaan. He went on to further assist Verlaine and Princess Leia Organa in their mission to unite the surviving Alderaanians, during which time he helped Organa escape from potential Imperial captivity. Only a few years later, Nunb became part of the Alliance Fleet and flew as the co-pilot for General Lando Calrissian aboard the Millennium Falcon during the Battle of Endor. Together, they fought against Imperial forces while attempting to destroy the Death Star II in orbit of the forest moon of Endor. Their battle was a success, and the Millennium Falcon fired the shot that destroyed the Death Star and delivered a devastating blow to the Galactic Empire. Three decades later, Nunb was a starfighter pilot in the Resistance and fought in the First Order–Resistance conflict, including the Battle of Starkiller Base.",
		    "image": "http://vignette3.wikia.nocookie.net/starwars/images/c/c7/NienNunbHS-SWE.jpg/revision/latest?cb=20111120232928"
		},
		{
			"name": "Qui-Gon Jinn", 
		    "height": "193", 
		    "mass": "89", 
		    "hair_color": "brown", 
		    "skin_color": "fair", 
		    "eye_color": "blue", 
		    "birth_year": "92BBY", 
		    "gender": "male", 
		    "homeworld": "unknown", 
		    "species": "Human", 
		    "description": "Qui-Gon Jinn was a revered, yet maverick and unconventional Human male Jedi Master. He was the Padawan to Count Dooku, and the mentor to Obi-Wan Kenobi and briefly Anakin Skywalker. Jinn often placed himself in conflict with the Jedi High Council. He was deeply attuned to the Living Force, which contributed to him frequently taking side trips to help seemingly weak and useless life-forms. Despite his opposition to the council, he was regarded by many Jedi as sharp-witted and possessing great wisdom. Jinn served the Galactic Republic and the Jedi Order his entire life, participating in the Stark Hyperspace War and actions against the Nebula Front, most famously during the Invasion of Naboo. It was Jinn who discovered the Chosen One, Anakin Skywalker, on Tatooine during this crisis and was largely responsible for championing his training. Even after his death at the hands of Darth Maul, he played a vital role in the legacy of the Jedi Order.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/c/c0/Quigonheadshot.jpg/revision/latest?cb=20100309144123"
		},
		{
			"name": "Nute Gunray", 
		    "height": "191", 
		    "mass": "90", 
		    "hair_color": "none", 
		    "skin_color": "mottled green", 
		    "eye_color": "red", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Cato Neimoidia", 
		    "species": "Neimodian",
		    "description": "Nute Gunray was a Neimoidian male who served as a stint Minister of the Trade Federation until he rose in power after the Stark Hyperspace War in 44 BBY, eventually becoming Viceroy of the Trade Federation. In 32 BBY, Gunray participated in the occupation of Naboo with the Federation Army to settle a trade dispute that began in the Galactic Senate. With the help of Darth Sidious, Gunray invaded the planet to end the trade dispute and secured all facilities in the capital of Theed. He attempted to force the incumbent Queen of Naboo Padmé Amidala to sign a treaty to make his invasion legal, however she refused and the Siege of Naboo continued. The Trade Federation soon surrendered to Naboo forces following the Battle of Naboo. Gunray was taken to the Galactic Republic capital on Coruscant to be charged with acts of war. During the Separatist Crisis that following the Invasion of Naboo, Gunray confronted former Jedi Master, Count Dooku, who began a separatist movement that opposed the Republic. Dooku, who secretly was Sidious's Sith apprentice under the name of Darth Tyranus, helped him through his four trials in the Supreme Court, and soon after the trials, Gunray retained his position as Viceroy. The Trade Federation, under Gunray's command, joined Dooku's separatist movement and Gunray was named Head of the newly formed Separatist Council and so formed the Separatist Army. Gunray, along with Dooku and his master, Sidious, formed the Confederacy of Independent Systems which opposed the Galactic Republic in a three-year war known as the Clone Wars that followed after two years of the Separatist Crisis.",
		    "image": "http://vignette4.wikia.nocookie.net/starwars/images/f/fe/Nutegunraypromo_copy.jpg/revision/latest?cb=20090417195344"
		},
		{
			"name": "Finis Valorum", 
		    "height": "170", 
		    "mass": "unknown", 
		    "hair_color": "blond", 
		    "skin_color": "fair", 
		    "eye_color": "blue", 
		    "birth_year": "91BBY", 
		    "gender": "male", 
		    "homeworld": "Coruscant", 
		    "species": "Human", 
		    "description": "Finis Valorum was a human male politician from House Valorum who served as the penultimate Supreme Chancellor of the Galactic Republic. His administration was hampered by corruption and bureaucracy in the Galactic Senate, which Valorum was unable to bring under control. Towards the end of his administration, Valorum attempted to resolve the Trade Federation's Invasion of Naboo to little effect. As a result of government inaction, Queen Padmé Amidala of Naboo called for a Vote of No Confidence in Valorum's leadership. The Senate scheduled an election for a new Chancellor, and Valorum was replaced by Senator Sheev Palpatine of Naboo; Palpatine was secretly Darth Sidious, the Dark Lord of the Sith, and had orchestrated the Naboo Crisis to become Supreme Chancellor and, ultimately, transform the Republic into the Galactic Empire.",
		    "image": "http://vignette3.wikia.nocookie.net/starwars/images/5/51/ValorumPortrait-SWE.png/revision/latest?cb=20121109223309"
		},
		{
			"name": "Padmé Amidala", 
		    "height": "185", 
		    "mass": "45", 
		    "hair_color": "brown", 
		    "skin_color": "light", 
		    "eye_color": "brown", 
		    "birth_year": "46BBY", 
		    "gender": "female", 
		    "homeworld": "Naboo",
		    "species": "Human", 
		    "description": "Padmé Naberrie, known publicly as Padmé Amidala, was a human female politician who became an influential figure in the declining days of the Galactic Republic. Amidala was elected Queen of Naboo at a young age, and led her people through the Trade Federation's invasion of the planet. With the help of the Jedi Order, Amidala was able to lead her people in liberating Naboo from the Federation. When her two terms as queen ended, there was a movement to amend the law so she could continue to serve, but she declined and instead accepted the role of Senator of Naboo. In the lead-up to the Clone Wars, Senator Amidala was an outspoken critic of the creation of a Grand Army of the Republic to combat the Confederacy of Independent Systems. The war broke out anyway, however, and Amidala was present on Geonosis during the first battle; Amidala had been captured there by the Separatists, leading to her fighting in the ensuing battle. After the battle, Amidala secretly married Jedi Knight Anakin Skywalker. Amidala continued her pursuit of peace after the war began, attempting to broker a peaceful solution between the Republic and the Separatist Alliance. Those attempts failed, however, though Amidala did achieve some victories against the war hawks, including in her push to allow Mandalore to declare neutrality in the war. The war continued on, often separating Skywalker and Amidala for long periods of time. At the end of the war, Amidala became pregnant with twins, and Skywalker began having visions of her dying in childbirth. His attempts to save her led him to the dark side of the Force, and he became the Sith Lord Darth Vader. In the ensuing days, and after the destruction of the Jedi Order, Supreme Chancellor Sheev Palpatine—who was secretly the Sith Lord Darth Sidious—transformed the Republic into the Galactic Empire. Amidala later tried to save Vader from the dark side, but failed in her efforts. She lost the will to live and died just after giving birth to her twins, Luke and Leia. Leia followed in her mother's footsteps, becoming a member of the Rebel Alliance, while Luke became a Jedi Knight and redeemed Anakin from the dark side. Amidala was also the maternal grandmother of Leia and Han Solo's son Ben, who would later be known as Kylo Ren.",
		    "image": "http://vignette4.wikia.nocookie.net/starwars/images/b/b2/Padmegreenscrshot.jpg/revision/latest?cb=20100423143631"
		},
		{
			"name": "Jar Jar Binks", 
		    "height": "196", 
		    "mass": "66", 
		    "hair_color": "none", 
		    "skin_color": "orange", 
		    "eye_color": "orange", 
		    "birth_year": "52BBY", 
		    "gender": "male", 
		    "homeworld": "Naboo", 
		    "species": "Gungan", 
		    "description": "Jar Jar Binks was the first Gungan to represent his people in the Galactic Senate, first serving as a Junior Representative along with Senator Padmé Amidala, and then, after her death, serving as full Senator himself. Like most Gungans, Binks was lanky and spoke Basic with a unique accent. Despite being naïve and clumsy, Jar Jar Binks contributed greatly to the fate of the Galactic Republic, both for good and ill. He was a General, Representative, and later a Senator. Binks was also one of Qui-Gon Jinn's companions during the Invasion of Naboo, traveling to distant worlds such as Tatooine and Coruscant, an activity not taken up by many Gungans. On his return to Naboo, he served as a Bombad General for a short while in the Gungan Grand Army, and was a joint commander of the Battle of the Great Grass Plains with General Ceel. Binks later helped his people colonize the nearby Naboo moon Ohma-D'un. During his career as Junior Representative, he acted as Amidala's proxy and proposed giving Supreme Chancellor Palpatine emergency powers in order to deal with the Separatist Crisis. Binks would continue his public service even after the death of Amidala, taking her place as Senator of the Chommell sector in the newly-reformed Imperial Senate.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/4/42/JarJarHS-SWE.jpg/revision/latest?cb=20111208042120"
		},
		{
			"name": "Roos Tarpals", 
		    "height": "224", 
		    "mass": "82", 
		    "hair_color": "none", 
		    "skin_color": "grey", 
		    "eye_color": "orange", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Naboo", 
		    "species": "Gungan", 
		    "description": "Roos Tarpals was a Gungan male who served in the Gungan Grand Army during the Invasion of Naboo and the Clone Wars. Prior to the Invasion of Naboo, he served as captain of a patrol in Otoh Gunga. After the Battle of Naboo, Tarpals was promoted to general. During the Clone Wars, he sacrificed himself to protect Naboo from being conquered by General Grievous.",
		    "image": "http://vignette3.wikia.nocookie.net/starwars/images/c/ca/TarpalsHS.jpg/revision/latest?cb=20110927025354"
		},
		{
			"name": "Rugor Nass", 
		    "height": "206", 
		    "mass": "unknown", 
		    "hair_color": "none", 
		    "skin_color": "green", 
		    "eye_color": "orange", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Naboo", 
		    "species": "Gungan", 
		    "description": "Rugor Nass, also known as Boss Nass, was a male Ankura Gungan. He was the Boss of all the Otolla Gungans, of Otoh Gunga, and of the Gungan High Council at the time of the Invasion of Naboo. He led his people successfully through the trying times of the invasion, and even swallowed his pride, allowing the Naboo to make use of the Gungan Grand Army. Following the invasion, he broke new ground in Gungan progress, by establishing a colony on the moon Ohma-D'un. Nass was a proud ruler, and was the foremost Gungan of his time. He was respected by his peers, and was well known for his stubbornness. He held a bitter prejudice against Humans, a prejudice that could have led to his downfall if not for the intervention of Queen Padmé Amidala.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/d/d8/Bossnass.jpg/revision/latest?cb=20111105231711"
		},
		{
			"name": "Ric Olié", 
		    "height": "183", 
		    "mass": "unknown", 
		    "hair_color": "brown", 
		    "skin_color": "fair", 
		    "eye_color": "blue", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Naboo", 
		    "species": "Human",
		    "description": "Ric Olié was a Human male starfighter and starship pilot who served in the Royal Naboo Security Forces. He was the commander of the Naboo Royal Space Fighter Corps, and the leader of Echo Flight, Alpha Flight and Bravo Squadron. An expert pilot, he was qualified to fly any vessel that was a part of Naboo's fleet. Olié's talents also landed him the job of the Queen's personal pilot, often flying the Royal starship in the service of Padmé Amidala. Due to Naboo's pacifistic nature, Olié's skills were rarely in use, although he saw military action during the Invasion of Naboo. He was also slightly superstitious, and thought of his astromech droid R2-A6 as a good luck charm.",
		    "image": "http://vignette4.wikia.nocookie.net/starwars/images/4/4c/RicOlieHS-SWE.png/revision/latest?cb=20120226230538"
		},
		{
			"name": "Watto", 
		    "height": "137", 
		    "mass": "unknown", 
		    "hair_color": "black", 
		    "skin_color": "blue, grey", 
		    "eye_color": "yellow", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Toydaria", 
		    "species": "Toydarian", 
		    "description": "Watto was a Toydarian junk dealer living in Mos Espa, Tatooine. Owner of a small shop, Watto won two slaves, Shmi and her son, Anakin, from Gardulla the Hutt in a bet. Watto was an inveterate gambler, and when he discovered Anakin's natural podracing abilities, he sponsored the boy in several Podraces. Despite this, Watto often bet against Anakin, who was talented but lacked experience. Watto eventually lost Anakin to Jedi Master Qui-Gon Jinn in a wager on the Boonta Eve race. Years later, Watto sold Shmi to the moisture farmer Cliegg Lars. Once Anakin returned to Tatooine, Watto asked him if he could help with some 'deadbeats who owe me a lot of money.' After being asked about Shmi, Watto tried to help Anakin find his mother, giving him all of the information he knew about Shmi's new life and location. Watto treated him well at this time, but most likely only because he used to treat Anakin harshly, and since Anakin was now a Jedi with a lightsaber, Watto was intimidated to the point of absolute respecting of his former slave.",
		    "image": "http://vignette1.wikia.nocookie.net/starwars/images/e/eb/WattoHS.jpg/revision/latest?cb=20081222024729"
		},
		{
			"name": "Sebulba", 
		    "height": "112", 
		    "mass": "40", 
		    "hair_color": "none", 
		    "skin_color": "grey, red", 
		    "eye_color": "orange", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Malastare", 
		    "species": "Dug", 
		    "description": "Sebulba was a male Dug who hailed from the planet of Malastare. A vicious Podracer pilot who flew a massive orange Podracer with a split-x configuration, Sebulba would often bump and smash his way through the competition. A skilled pilot in his own right, he nonetheless opted to install various illegal weapons on his Podracer, such as a flamethrower built into the left engine, to ensure his victories on the track. The crowd favorite of a course known as the Boonta Eve Classic, located on the Outer Rim planet of Tatooine, Sebulba maintained a strong rivalry with one of Podracings few Human participants, a young boy named Anakin Skywalker. A short while after the Invasion of Naboo, Sebulba and Skywalker competed in a Boonta race together. Early in the race, Sebulba bested the competitor Mawhonic, before snuffing out more pilots during the second lap. After several more close calls, Sebulba and Skywalker eventually raced into the third lap neck and neck. The Dug nearly dispatched Skywalker near the end of the lap, but the Human regained his ground. The two continued the battle for first place until Sebulba crashed into the desert sands after his cockpit got tangled with Skywalker's engines. The wreck paved the way to victory lane for Skywalker, which earned the boy his freedom from slavery. Sebulba survived his wreck and continued to race into the Clone Wars.",
		    "image": "http://vignette4.wikia.nocookie.net/starwars/images/1/14/Sebulba_Headshot_Closeup.png/revision/latest?cb=20140608175525"
		},
		{
			"name": "Quarsh Panaka", 
		    "height": "183", 
		    "mass": "unknown", 
		    "hair_color": "black", 
		    "skin_color": "dark", 
		    "eye_color": "brown", 
		    "birth_year": "62BBY", 
		    "gender": "male", 
		    "homeworld": "Naboo", 
		    "species": "Human",
		    "description": "Quarsh Panaka was a Human male who served as the head of the Royal Naboo Security Forces before, during, and after the Invasion of Naboo, and later was the Moff for the Chommell sector during the Galactic Civil War. He was a vocal militarist among the peaceful people of Naboo, a fish out of water amongst his peers. Shaken by the murder of King Ars Veruna, he installed various security measures to make sure that the same thing did not happen to his second monarch, Queen Padmé Amidala. By learning from the mistakes of his predecessor, Maris Magneta, he was able to successfully defend her in several periods of danger, and continued to serve Naboo, the Republic, and eventually, the Empire. Notoriously conservative, Panaka often clashed with the Jedi Master Qui-Gon Jinn during the Invasion of Naboo, deriding the Jedi's controversial methods and retaining the utmost faith in his own. Nevertheless, with Jinn's help he was able to get his chance at military action, in the Battle of Naboo.",
		    "image": "http://vignette3.wikia.nocookie.net/starwars/images/7/72/PanakaHS-TPM.png/revision/latest?cb=20130126044005"
		},
		{
			"name": "Shmi Skywalker", 
		    "height": "163", 
		    "mass": "unknown", 
		    "hair_color": "black", 
		    "skin_color": "fair", 
		    "eye_color": "brown", 
		    "birth_year": "72BBY", 
		    "gender": "female", 
		    "homeworld": "Tatooine", 
		    "species": "Human", 
		    "description": "Shmi Skywalker Lars was the human mother of the Jedi Knight Anakin Skywalker, as well step-mother to Owen Lars and the paternal grandmother of Luke Skywalker and Leia Organa. Through her granddaughter Leia, Shmi would become the maternal great-grandmother of Leia's son, Ben, who would become Kylo Ren. A slave, Shmi gave birth to a son she named Anakin, who was conceived by the midi-chlorians to fulfill the prophecy of the Chosen One who would bring balance to the Force. After Anakin left to become a Jedi, she was sold to Cliegg Lars, who freed her and married her. Just before the Clone Wars, Shmi died in her son's arms after being brutally tortured by a band of Tusken Raiders. A couple of years after her death, Shmi appeared to her son Anakin on the planet Mortis. This vision was conjured by the Son, a member of a trio of powerful Force wielders who wanted to test whether Anakin was indeed the Chosen One. During their brief meeting, Shmi attempted to convince Anakin to abandon his relationship with his secret wife Padmé Amidala since that attachment would lead to the dark side of the Force.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/e/e0/ShmiHS-SWE.jpg/revision/latest?cb=20111117025406"
		},
		{
			"name": "Darth Maul", 
		    "height": "175", 
		    "mass": "80", 
		    "hair_color": "none", 
		    "skin_color": "red", 
		    "eye_color": "yellow", 
		    "birth_year": "54BBY", 
		    "gender": "male", 
		    "homeworld": "Dathomir", 
		    "species": "Zabrak", 
		    "description": "Darth Maul was a male Dathomirian Zabrak Dark Lord of the Sith who lived during the waning years of the Galactic Republic. Originally a Dathomiri Nightbrother born on Iridonia and known only as Maul, the infant Maul was given by his Nightsister mother to the Sith Lord Darth Sidious, who trained him in the ways of the dark side of the Force as his secret apprentice on a secret Mustafar training facility, along with the help of a split personality droid. Maul became a master of Juyo, Ataru, Jar'Kai, and Teräs Käsi, with training in Niman, and chose to wield a red-bladed saberstaff in combat. Though well trained in the ways of the Sith and a Sith assassin rather than a full apprentice, Maul was technically a violation of the Rule of Two because his own Master was at the time apprenticed to another, the Muun Sith Lord Darth Plagueis. Plagueis however, was fully aware of Maul's existence, and supported Sidious's decision to train him. The primary reason for Plagueis's support, despite the violation of the Rule of Two, was that Maul was trained to be expendable. As an assassin, he could perform high priority, boots-on-the-ground missions for the Sith without running the risk of exposing either Plagueis or Sidious should he fail. In 33 BBY, Sidious gave Maul his first mission: to put the criminal organization Black Sun in disarray. Maul carried out this task perfectly, dealing the group a grievous blow. Maul played an instrumental role in the invasion of the planet Naboo in 32 BBY. The crisis was engineered by Darth Sidious, who lived a double life as Senator Palpatine of Naboo, to have Supreme Chancellor Finis Valorum removed from office, allowing Sidious to take his place and set the stages for a government ruled by the Sith. After Padmé Amidala, queen of the Naboo, escaped the blockade, Maul was dispatched to follow her. He found her on Tatooine, where he had a short but intense duel with Jedi Master Qui-Gon Jinn, revealing the existence of the Order of the Sith Lords to the Jedi, who had thought the Sith extinct. Later, Maul was sent to Naboo, where he fought Jinn and his apprentice, Obi-Wan Kenobi. Though he killed the Jedi Master, Maul underestimated Kenobi’s skill and was severed in half at the waist by the Padawan. Sidious would quickly replace Maul with another powerful apprentice: the late Jinn's former Master, Dooku, who had fallen to the dark side, and whom Sidious dubbed Darth Tyranus.",
		    "image": "http://vignette4.wikia.nocookie.net/starwars/images/5/50/Darth_Maul_profile.png/revision/latest?cb=20140209162228"
		},
		{
			"name": "Bib Fortuna", 
		    "height": "180", 
		    "mass": "unknown", 
		    "hair_color": "none", 
		    "skin_color": "pale", 
		    "eye_color": "pink", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Ryloth", 
		    "species": "Twi'lek", 
		    "description": "Bib Fortuna was a male Twi'lek from Ryloth. Bib served as a majordomo to Jabba Desilijic Tiure for many years. Considering he served Jabba for decades, it is unsurprising that few in the galaxy hated the Hutt as much as he did—the Twi'lek majordomo had tried many times unsuccessfully to have Jabba killed. A member of the Una Clan, Bib Fortuna was friendly with many B'omarr monks in Jabba's Palace—when he died, his brain was forcibly removed from his body by the ancient religious order.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/3/33/BibFortunaHS-ROTJ.png/revision/latest?cb=20130326042806"
		},
		{
			"name": "Ayla Secura", 
		    "height": "178", 
		    "mass": "55", 
		    "hair_color": "none", 
		    "skin_color": "blue", 
		    "eye_color": "hazel", 
		    "birth_year": "48BBY", 
		    "gender": "female", 
		    "homeworld": "Ryloth", 
		    "species": "Twi'lek", 
		    "description": "Aayla Secura, born Aaylas'ecura, was a female Rutian Twi'lek Jedi Master in the later days of the Republic, who served with distinction as a General during the Clone Wars. She served as a Padawan under the tutelage of Quinlan Vos, and later, Vos' own master Tholme. Both Secura and Vos survived a brush with the dark side early in their Jedi training, though she later proved herself worthy of knighthood. After Secura was promoted to the level of Jedi Knight, the Clone Wars broke out, and she was one of many Jedi to participate in the First Battle of Geonosis. She served in various campaigns, surviving such infamous battles as those on Hypori and Kamino. Indeed, such were her achievements that Secura was promoted to the level of Jedi Master near the beginning of the conflict. As a Jedi Master, Aayla Secura led the Republic war efforts at Quell and was instrumental in the defense of Kamino and later Maridun. However, despite her undoubted prowess, Secura met her end during the instigation of Order 66 on Felucia. Master Secura was remembered for generations by the people of the worlds she had helped during her life, and stories of her were known to have become part of the culture of many such people.",
		    "image": "http://vignette1.wikia.nocookie.net/starwars/images/f/f9/Aayla.jpg/revision/latest?cb=20120815094201"
		},
		{
			"name": "Ratts Tyerel", 
		    "height": "79", 
		    "mass": "15", 
		    "hair_color": "none", 
		    "skin_color": "grey, blue", 
		    "eye_color": "unknown", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Aleen Minor", 
		    "species": "Aleena", 
		    "description": "Ratts Tyerell was an Aleena Podracer pilot who flew a massive Podracer during the Boonta Eve Classic Podrace which took place during the Invasion of Naboo. Tyerell had a drive to beat the reigning champion, the Dug Sebulba. During the race, Tyerell flew into the Laguna Caves, where his accelerator jammed. Unable to control his Podracer, the little Aleena could only throw his arms into the air and scream as he fatally collided with a stalactite. His family was reportedly seen mourning after the race's conclusion.",
		    "image": "http://vignette1.wikia.nocookie.net/starwars/images/3/3b/Databank_rattstyerell.jpeg/revision/latest?cb=20140807160747"
		},
		{
			"name": "Dud Bolt", 
		    "height": "94", 
		    "mass": "45", 
		    "hair_color": "none", 
		    "skin_color": "blue, grey", 
		    "eye_color": "yellow", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Vulpter", 
		    "species": "Vulptereen", 
		    "description": "Dud Bolt was a Vulptereen male hit man who competed as a professional Podracer pilot during the waning years of the Galactic Republic. Bolt held a reputation of being highly aggressive on the course, with his battered and scarred Vulptereen 327 Podracer a testament to his brutality. Unbeknownst to most, Bolt worked as the mid-air bodyguard for notorious fellow pilot Sebulba, a vicious Dug who employed various illegal tactics to gain the upper hand during a race. Despite what appeared to be a simple, if brutal, existence on the track, Bolt was a decent pilot with a well-oiled racing machine. He scored record lap times on the planet Malastare and even held the crowd's favor for the Malastare 100 racecourse, though he rarely won his races. Bolt eventually followed Sebulba to the desert planet Tatooine in order to participate in the Boonta Eve Classic of 32 BBY. During the race's third lap, the Nuknog pilot Ark Roose caught Bolt's attention, and, determining him to be a threat, Bolt totaled Roose's racer while destroying his own Vulptereen 327 in the process. By the 24 BBY Podracing season, the Glymphid Aldar Beedo, a pilot and assassin who had previously been hunting Sebulba, replaced Bolt as the Dug's bodyguard. Bolt made it a note to eventually dispose of both Sebulba and Beedo during a future race. The Vulptereen held up his career at least through 22 BBY, as he furthered his fame to the planet Utapau.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/b/b0/Dud_Bolt.jpg/revision/latest?cb=20061130092516"
		},
		{
			"name": "Gasgano", 
		    "height": "122", 
		    "mass": "unknown", 
		    "hair_color": "none", 
		    "skin_color": "white, blue", 
		    "eye_color": "black", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Troiken", 
		    "species": "Xexto", 
		    "description": "Gasgano was a Xexto male Podracer pilot who participated in the Boonta Eve Classic Podrace on the desert planet Tatooine during the Invasion of Naboo. Gasgano wanted nothing more than to win the race, piloting his green Ord Pedrovia Podracer. For the majority of the race, Gasgano tailed the leaders, but ended up losing to the human Anakin Skywalker.",
		    "image": "http://vignette1.wikia.nocookie.net/starwars/images/5/57/GasganoHS-SWE.jpg/revision/latest?cb=20120112024006"
		},
		{
			"name": "Ben Quadinaros", 
		    "height": "163", 
		    "mass": "65", 
		    "hair_color": "none", 
		    "skin_color": "grey, green, yellow", 
		    "eye_color": "orange", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Tund", 
		    "species": "Toong", 
		    "description": "Ben Quadinaros was a Toong Podracer pilot who had very little actual racing experience when he participated in the Boonta Eve Classic that saw the liberation of the slave boy Anakin Skywalker. Piloting a BT310 quadra-Podracer, Quadinaros never left the starting grid due to his pod stalling. A short while later, his power coupling failed, causing his engine's energy binders to deactivate. This caused the hapless Toong's engines to spiral away from the cockpit and fly off and explode on various parts of the Mos Espa Grand Arena. Despite this loss, Quadinaros continued to Podrace up to ten years later, during the time of the Clone Wars.",
		    "image": "http://vignette4.wikia.nocookie.net/starwars/images/7/7f/Cropped_Quadinaros.png/revision/latest?cb=20150630012608"
		},
		{
			"name": "Mace Windu", 
		    "height": "188", 
		    "mass": "84", 
		    "hair_color": "none", 
		    "skin_color": "dark", 
		    "eye_color": "brown", 
		    "birth_year": "72BBY", 
		    "gender": "male", 
		    "homeworld": "Haruun Kal", 
		    "species": "Human", 
		    "description": "Mace Windu was a male human Jedi Master and Master of the Order who was the second most senior of the Jedi during the final years of the Galactic Republic, after Grand Master Yoda. It was Master Windu who led two hundred and twelve Jedi into combat at the Battle of Geonosis and slew the infamous bounty hunter Jango Fett, leading his son Boba Fett to hate Mace Windu and even try to kill him. He continued to serve the Republic throughout the Clone Wars, often leading troops into battle, despite his misgivings about the militarization of the Jedi Order. In the final days of the war, Windu and three other Jedi confronted Darth Sidious. The three other Jedi, including Kit Fisto, were all slain by Sidious, leaving only Windu to duel the Sith Lord. Windu defeated Sidious in a difficult duel, after being informed by Jedi Knight Anakin Skywalker that Sidious and Supreme Chancellor Sheev Palpatine were one and the same person. As Skywalker rushed to the scene, Sidious lay disarmed on the edge of the window in his office with Windu holding his lightsaber on Sidious. Sidious then told Anakin that if he died he would lose Padmé as he saw in his vision, Anakin wanted to keep him alive but merely as an excuse to help him bring her back. Windu was ultimately prevented from slaying Sidious by Skywalker and forced out the window by Sidious. The Galactic Empire would later teach in its history books that Windu was the leader of a 'criminal gang' who sparked the Clone Wars by interfering with a legal execution on Geonosis.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/f/fc/Mace_Windu.jpg/revision/latest?cb=20071230055326"
		},
		{
			"name": "Ki-Adi-Mundi", 
		    "height": "198", 
		    "mass": "82", 
		    "hair_color": "white", 
		    "skin_color": "pale", 
		    "eye_color": "yellow", 
		    "birth_year": "92BBY", 
		    "gender": "male", 
		    "homeworld": "Cerea", 
		    "species": "Cerean", 
		    "description": "Ki-Adi-Mundi was a male, Cerean Jedi Master, who served on the Jedi High Council during the last years of the Galactic Republic. He was among the Jedi participating in the Battle of Geonosis. He became a Jedi General during the Clone Wars and took part in such conflicts as the Second Battle of Geonosis. While he was leading a contingent of Galactic Marines on Mygeeto, he was executed by his own forces under Order 66.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/9/9e/KiAdiMundi.jpg/revision/latest?cb=20070930185700"
		},
		{
			"name": "Kit Fisto", 
		    "height": "196", 
		    "mass": "87", 
		    "hair_color": "none", 
		    "skin_color": "green", 
		    "eye_color": "black", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Glee Anselm", 
		    "species": "Nautolan", 
		    "description": "Kit Fisto was a Nautolan Jedi Master during the last years of the Galactic Republic. He was among the Jedi who fought in the Battle of Geonosis and was one of the few survivors out of the 200 Jedi who traveled there. He became a Jedi General of the Clone Army in the Clone Wars and took part in such conflicts as the Mission to Vassek's third moon and the Battle of Mon Cala. He was also involved in a mission with his former Padawan Nahdar Vebb to capture the escaped prisoner, Nute Gunray—however, the two ended up facing the notorious Jedi hunter General Grievous inside his lair. While Vebb perished at the hands of the General, Fisto very nearly bested him in combat, and escaped with his life, but without Gunray, ultimately making the mission a failure. At some point during the Clone Wars, Fisto accepted a seat on the Jedi Council. While he was at the Jedi Temple, Anakin Skywalker revealed to Mace Windu that Chancellor Sheev Palpatine was a Sith Lord. Windu took Fisto, alongside Jedi Masters Agen Kolar and Saesee Tiin to Palpatine's office to arrest him. In the following duel, after Kolar and Tiin had perished, Fisto was killed by the Chancellor.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/1/17/KitFisto-SithSnapshot.jpg/revision/latest?cb=20051006220620"
		},
		{
			"name": "Eeth Koth", 
		    "height": "171", 
		    "mass": "unknown", 
		    "hair_color": "black", 
		    "skin_color": "brown", 
		    "eye_color": "brown", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Iridonia",
		    "species": "Zabrak", 
		    "description": "Eeth Koth was a male Iridonian Zabrak Jedi Master who fought during the Clone Wars in battles such as the Battle of Geonosis. At some point in the war, Koth was kidnapped by General Grievous but was rescued by Adi Gallia, Obi-Wan Kenobi and Anakin Skywalker. He was a member of the Jedi High Council during the Clone Wars and participated in many battles throughout the galaxy.",
		    "image": "http://vignette1.wikia.nocookie.net/starwars/images/b/b6/Eeth_Koth_profile.png/revision/latest?cb=20131103213648"
		},
		{
			"name": "Adi Gallia", 
		    "height": "184", 
		    "mass": "50", 
		    "hair_color": "none", 
		    "skin_color": "dark", 
		    "eye_color": "blue", 
		    "birth_year": "unknown", 
		    "gender": "female", 
		    "homeworld": "Coruscant", 
		    "species": "Tholothian", 
		    "description": "Adi Gallia was a female Tholothian Jedi Master who sat on the Jedi High Council during the Clone Wars. She fought in a number of engagements during the war, serving as a General in the Grand Army of the Republic. She participated on a mission to save Eeth Koth along with Anakin Skywalker and Obi Wan Kenobi; the mission went well, but they weren't able to kill General Grievous. At another point, she and Kenobi were sent to investigate the actions of the Sith brothers Darth Maul and Savage Opress, who had been wreaking havoc in the Outer Rim Territories to draw the attention of the Jedi. The investigation led the two Jedi to Florrum, where Maul and Opress attempted to convert Hondo Ohnaka's gang of pirates to their cause. The presence of the Jedi led to a brief battle, in which Gallia was slain by Opress.",
		    "image": "http://vignette1.wikia.nocookie.net/starwars/images/c/c8/AdiGallia2-SWE.jpg/revision/latest?cb=20111115045121"
		},
		{
			"name": "Saesee Tiin", 
		    "height": "188", 
		    "mass": "unknown", 
		    "hair_color": "none", 
		    "skin_color": "pale", 
		    "eye_color": "orange", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Iktotch",
		    "species": "Iktotchi", 
		    "description": "Saesee Tiin was a male Iktotchi Jedi Master and a member of the Jedi High Council in the last days of the Galactic Republic. Having apprenticed under the esteemed Jedi Master Omo Bouri, Tiin rarely spoke and kept to himself. Never choosing to take a Padawan himself, Tiin took the rank of Jedi General in the Grand Army of the Republic during the Clone Wars. Tiin fought in the Stark Hyperspace War in 44 BBY during the fifth battle on Qotile and also participated in the Yinchorri Uprising of 33 BBY. Some time after that, he and other Jedi tracked down the terrorist Nebula Front movement to their base on Asmeru. Tiin fought on many battlefronts during the Clone Wars on planets such as Lola Sayu, Gwori, Boz Pity, Diado, Geonosis, and The Rig. A renowned starfighter ace, Tiin had been born on Iktotch, the moon of Iktotchon. Because of the battering winds of the moon, Tiin's species had adapted toughened skin and blunt features. A natural telepath, Master Tiin failed to foresee his demise at the hands of the secret Dark Lord of the Sith, Darth Sidious, who in reality, was Supreme Chancellor Palpatine of the Galactic Republic. Tiin's death on Coruscant in 19 BBY alongside that of Mace Windu, Kit Fisto and Agen Kolar to Darth Sidious marked the start of the Great Jedi Purge and Order 66.",
		    "image": "http://vignette3.wikia.nocookie.net/starwars/images/c/ca/Iktotchi_AA.JPG/revision/latest?cb=20071002144646"
		},
		{
			"name": "Yarael Poof", 
		    "height": "264", 
		    "mass": "unknown", 
		    "hair_color": "none", 
		    "skin_color": "white", 
		    "eye_color": "yellow", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Quermia", 
		    "species": "Quermian", 
		    "description": "Yarael Poof was a male Quermian Jedi Master who served on the Jedi High Council during the final years of the Galactic Republic. Both an expert practitioner of Jedi mind tricks and illusions and a skilled diplomat and teacher, Poof witnessed the reemergence of the Jedi's ancient enemy, the Sith, and the discovery of the Chosen One, Anakin Skywalker, who was to bring balance to the Force. By the time of the Battle of Geonosis, Poof's spot on the Council had been filled by the Vurk Jedi Master Coleman Trebor.",
		    "image": "http://vignette4.wikia.nocookie.net/starwars/images/6/66/Yarael_Poof_Canon.jpeg/revision/latest?cb=20151012223150"
		},
		{
			"name": "Plo Koon", 
		    "height": "188", 
		    "mass": "80", 
		    "hair_color": "none", 
		    "skin_color": "orange", 
		    "eye_color": "black", 
		    "birth_year": "22BBY", 
		    "gender": "male", 
		    "homeworld": "Dorin", 
		    "species": "Kel Dor", 
		    "description": "Plo Koon was a Kel Dor Jedi Master serving as a member of the Jedi High Council during the last years of the Galactic Republic. He frequently undertook dangerous missions. He was the Jedi who found Ahsoka Tano, with whom he would, from that moment, share a special bond. He was among the Jedi who participated in the Battle of Geonosis. He became a Jedi General in the Clone Wars and took part in such conflicts as the Battle of Abregado and the Battle of Felucia. While he was leading a squadron of ARC-170 starfighters on Cato Neimoidia, he was ruthlessly destroyed by his own troops after Order 66 was executed by Emperor Sheev Palpatine.",
		    "image": "http://vignette1.wikia.nocookie.net/starwars/images/c/c4/Plo_Koon_TPM.png/revision/latest?cb=20130911190623"
		},
		{
			"name": "Mas Amedda", 
		    "height": "196", 
		    "mass": "unknown", 
		    "hair_color": "none", 
		    "skin_color": "blue", 
		    "eye_color": "blue", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Champala",
		    "species": "Chagrian", 
		    "description": "Mas Amedda was a male Chagrian who served as Vice Chair of the Galactic Republic's Senate under Supreme Chancellor Finis Valorum during the Invasion of Naboo, and Supreme Chancellor Sheev Palpatine during the Secessionist Movement and the Clone Wars. He was known for his booming voice, which he used to call for order when shouting matches erupted in the Galactic Senate. He continued to hold his position once Palpatine transformed the Galactic Republic into the Galactic Empire. Sometime later Mas Amedda became Palpatine's Grand Vizier and head of the Imperial Ruling Council. Amedda, as Vice Chair and later Grand Vizier, was one of the few beings in the galaxy who knew some of Palpatine's darkest secrets.",
		    "image": "http://vignette1.wikia.nocookie.net/starwars/images/3/3f/Mas12432.jpg/revision/latest?cb=20130913002346"
		},
		{
			"name": "Gregar Typho", 
		    "height": "185", 
		    "mass": "85", 
		    "hair_color": "black", 
		    "skin_color": "dark", 
		    "eye_color": "brown", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Naboo", 
		    "species": "Human", 
		    "description": "Gregar Typho was a human male and a captain of the Royal Naboo Security Forces during the Secessionist Movement and the Clone Wars. He served as Senator Padmé Amidala's head of security, ensuring her safety at all costs. Typho followed in the footsteps of his uncle, Panaka, who was a Naboo Royal Security Forces captain during the Invasion of Naboo.",
		    "image": "http://vignette1.wikia.nocookie.net/starwars/images/5/52/Gregar_Typho.jpg/revision/latest?cb=20090903192036"
		},
		{
			"name": "Cordé", 
		    "height": "157", 
		    "mass": "unknown", 
		    "hair_color": "brown", 
		    "skin_color": "light", 
		    "eye_color": "brown", 
		    "birth_year": "unknown", 
		    "gender": "female", 
		    "homeworld": "Naboo", 
		    "species": "Human", 
		    "description": "Cordé was a handmaiden who served Senator Padmé Amidala in the days leading up to the Clone Wars. She was acting as a decoy when she and another handmaiden were killed in an attempt on Amidala's life by Clawdite bounty hunter Zam Wesell.",
		    "image": "http://vignette1.wikia.nocookie.net/starwars/images/d/de/Cord%C3%A9.jpg/revision/latest?cb=20130225181527"
		},
		{
			"name": "Cliegg Lars", 
		    "height": "183", 
		    "mass": "unknown", 
		    "hair_color": "brown", 
		    "skin_color": "fair", 
		    "eye_color": "blue", 
		    "birth_year": "82BBY", 
		    "gender": "male", 
		    "homeworld": "Tatooine", 
		    "species": "Human", 
		    "description": "Cliegg Lars was a Human male moisture farmer from Tatooine. He had one son, Owen Lars, from his first marriage. In the years prior to the Clone Wars, he met Shmi Skywalker and freed her from slavery before marrying her. As such, he was the step-father of Anakin Skywalker, and the step-grandfather of Luke Skywalker and Leia Organa. Shortly before the outbreak of the Clone Wars, Shmi was captured by Tusken Raiders. Lars and a number of other moisture farmers attempted to save her, but the sand people drove them back, and Lars lost his right leg as a result. Anakin Skywalker later arrived on Tatooine, having had visions through the Force of Shmi's suffering and met Lars. Skywalker found his mother, but she died in his arms and he returned her body to the Lars moisture farm for burial, where Lars said goodbye to his wife.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/3/36/ClieggLarsHS-SWE.jpg/revision/latest?cb=20120421063121"
		},
		{
			"name": "Poggle the Lesser", 
		    "height": "183", 
		    "mass": "80", 
		    "hair_color": "none", 
		    "skin_color": "green", 
		    "eye_color": "yellow", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Geonosis",
		    "species": "Geonosian", 
		    "description": "Archduke Poggle the Lesser was the public leader of the Geonosians during the Clone Wars, though he was subservient to Queen Karina the Great. He controlled the Geonosian battle droid factories, and was a powerful figure within the Confederacy of Independent Systems. The Archduke commanded the droid armies that fought against the Republic during the two battles for Geonosis. During the final stages of the war, he and the rest of the Separatist Council were relocated to Utapau and later on Mustafar, where he was cut in half by Darth Vader.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/7/79/Poggle_Geo.jpg/revision/latest?cb=20080118201719"
		},
		{
			"name": "Luminara Unduli", 
		    "height": "170", 
		    "mass": "56.2", 
		    "hair_color": "black", 
		    "skin_color": "yellow", 
		    "eye_color": "blue", 
		    "birth_year": "58BBY", 
		    "gender": "female", 
		    "homeworld": "Mirial", 
		    "species": "Mirialan", 
		    "description": "Luminara Unduli was a Mirialan female Jedi Master during the final days of the Jedi Order. She commanded the 41st Elite Corps of the Grand Army of the Republic, and was the master of Padawan Barriss Offee. Together, they fought in numerous battlefields of the Clone Wars, before Offee turned against the Jedi Order and bombed the Jedi Temple. At the end of the war, Unduli fought in the battle on Kashyyyk. She was arrested and executed after Supreme Chancellor Sheev Palpatine issued Order 66 and destroyed the Jedi Order. The Galactic Empire would later use her bones to attract Jedi into traps to kill any remaining Jedi that survived order 66. One such trap was laid for Kanan Jarrus and the crew of the Ghost, who believed Unduli was alive and being imprisoned on Stygeon Prime. They mounted a rescue mission, only to discover that it was a trap by the Grand Inquisitor. The rebels escaped with the knowledge that Unduli was dead and spread the word to dispell the ruse.",
		    "image": "http://vignette4.wikia.nocookie.net/starwars/images/e/ef/LuminaraHS-SWE.jpg/revision/latest?cb=20111117041643"
		},
		{
			"name": "Barriss Offee", 
		    "height": "166", 
		    "mass": "50", 
		    "hair_color": "black", 
		    "skin_color": "yellow", 
		    "eye_color": "blue", 
		    "birth_year": "40BBY", 
		    "gender": "female", 
		    "homeworld": "Mirial", 
		    "species": "Mirialan", 
		    "description": "Barriss Offee was a female Mirialan who trained as a Jedi Padawan during the Clone Wars. She carried a blue lightsaber and trained under Jedi Master Luminara Unduli. Offee was a survivor of the Battle of Geonosis and was extremely loyal to her Jedi Master. Offee preferred studying ancient Jedi texts to fighting and was a bit older than most Jedi Padawans. During her time as a Jedi Padawan, Offee struck up a friendship with Ahsoka Tano, the Padawan learner of Anakin Skywalker. Though rather different in personality, the two were bonded through shared experience in combat. As the Clone Wars continued, Offee grew disillusioned with the Jedi's role in the wars, believing they had lost their way from the ideals that the Jedi Order was supposed to represent and wary of the Jedi Council in particular. Deciding to act on her concerns, she orchestrated the bombing of the Jedi Temple as a means to foment further distrust of the Jedi, as clone troopers were killed during the attack. Despite their previous friendship, she allowed Tano to be framed for orchestrating the bombing, but ultimately confessed after being confronted by Anakin Skywalker, just before Tano was about to be convicted of the crime, and shared her views of the Jedi being corrupted by the dark side before being taken away.",
		    "image": "http://vignette3.wikia.nocookie.net/starwars/images/3/37/Barrisprofile2.jpg/revision/latest?cb=20070728014608"
		},
		{
			"name": "Dormé", 
		    "height": "165", 
		    "mass": "unknown", 
		    "hair_color": "brown", 
		    "skin_color": "light", 
		    "eye_color": "brown", 
		    "birth_year": "unknown", 
		    "gender": "female", 
		    "homeworld": "Naboo", 
		    "species": "Human", 
		    "description": "Dormé was a human female handmaiden in the service of Senator Padmé Amidala during the Secessionist Movement. Dormé traveled with Amidala from Naboo to Coruscant during the debate over the Military Creation Act, and she remained by Amidala's side during the multiple assassination attempts made against the senator by the Confederacy of Independent Systems.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/1/18/Dormesenate.jpg/revision/latest?cb=20070506233854"
		},
		{
			"name": "Dooku", 
		    "height": "193", 
		    "mass": "80", 
		    "hair_color": "white", 
		    "skin_color": "fair", 
		    "eye_color": "brown", 
		    "birth_year": "102BBY", 
		    "gender": "male", 
		    "homeworld": "Serenno", 
		    "species": "Human", 
		    "description": "Dooku was a human male Sith Lord and the political leader of the Confederacy of Independent Systems. Dooku was once a Jedi Master of the Jedi Order, but he left the Jedi and the Galactic Republic after growing disillusioned with the corruption in the government. He turned to the dark side and became the apprentice of Darth Sidious, taking on the name Darth Tyranus and reclaiming his title as the Count of Serenno. With his master, who was secretly Supreme Chancellor Palpatine, Dooku helped form the Separatist Alliance and engineer the Clone Wars. He was also involved in the creation of the clone troopers of the Grand Army of the Republic, having supplied the Kaminoans with the chip containing Clone Protocol 66. Count Dooku led the Separatist Alliance throughout the war, turning star systems against the Republic through political maneuverings and military might. He took on apprentices of his own, with the intention of one day succeeding his master. He first trained Asajj Ventress; later, after being ordered to dispose of Ventress, Dooku took on a second apprentice, Savage Opress. The tutelage was short-lived, however, as Opress had been used by Ventress as a tool of revenge against her former master. Toward the end of the war, Dooku took on a third apprentice, the fallen Jedi Quinlan Vos, with whom he plotted to overthrow his master. This apprenticeship, too, was cut short, as Vos was redeemed in the Force with the help of Asajj Ventress. The final days of the war saw a battle over Coruscant. In a duel aboard the Separatist command ship, Dooku was defeated by Jedi Knight Anakin Skywalker, who beheaded the helpless Dooku at Palpatine's instigation. Dooku was soon replaced as Palpatine's apprentice by Skywalker himself, who fell to the dark side and became Darth Vader. Despite Dooku's death, the plans he helped set into motion during the Clone Wars came to pass, with the destruction of the Jedi Order and the rise of the Galactic Empire.",
		    "image": "http://vignette3.wikia.nocookie.net/starwars/images/f/f1/Count_Dooku_headshot_gaze.jpg/revision/latest?cb=20071218042012"
		},
		{
			"name": "Bail Prestor Organa", 
		    "height": "191", 
		    "mass": "unknown", 
		    "hair_color": "black", 
		    "skin_color": "tan", 
		    "eye_color": "brown", 
		    "birth_year": "67BBY", 
		    "gender": "male", 
		    "homeworld": "Alderaan", 
		    "species": "Human", 
		    "description": "Bail Prestor Organa (formally styled as His Serene Highness, Prince Bail Organa, First Chairman and Viceroy of Alderaan) was a Human male who served as the First Chairman and Viceroy of Alderaan, and served in the Galactic Senate as the Senator of the Alderaan sector from 32 BBY to 19 BBY. Subsequently, he was Senator of the Alderaan sector of the Imperial Senate from 19 BBY to 1 BBY. He was Princess Leia Organa's adoptive father and a friend of Jedi Masters Obi-Wan Kenobi, Yoda and Rahm Kota. He was married to Queen Breha Organa of Alderaan and was, as Prince Consort, head of the royal house and ruler of Alderaan. One of the main founders of the Rebel Alliance, he was killed when the Death Star obliterated Alderaan. In the Alliance and its successor states, the New Republic and Galactic Federation of Free Alliances, he was respected as a martyr who died for his cause.",
		    "image": "http://vignette3.wikia.nocookie.net/starwars/images/5/50/Bail_Organa_Mug.jpg/revision/latest?cb=20080823033853"
		},
		{
			"name": "Jango Fett", 
		    "height": "183", 
		    "mass": "79", 
		    "hair_color": "black", 
		    "skin_color": "tan", 
		    "eye_color": "brown", 
		    "birth_year": "66BBY", 
		    "gender": "male", 
		    "homeworld": "Concord Dawn", 
		    "species": "Human", 
		    "description": "Jango Fett was a male human from the planet Concord Dawn, and was widely regarded as the best bounty hunter in the galaxy during the last years of the Galactic Republic. Fett wore a set of Mandalorian armor as a bounty hunter, though he was considered a pretender by the New Mandalorian government of Mandalore. In the years preceding the Clone Wars, Fett was recruited by the Sith Lord Darth Tyranus to be the genetic template of the clone troopers for the Grand Army of the Republic. Fett was also behind the assassination attempts against Senator Padmé Amidala on behalf of the Confederacy of Independent Systems. After Fett's death during the Battle of Geonosis, his son, Boba Fett—an unaltered clone whom he raised as his own child—followed in his father's footsteps and became one of the deadliest bounty hunters in the galaxy.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/5/56/JangoInfobox.png/revision/latest?cb=20151220040220"
		},
		{
			"name": "Zam Wesell", 
		    "height": "168", 
		    "mass": "55", 
		    "hair_color": "blonde", 
		    "skin_color": "fair, green, yellow", 
		    "eye_color": "yellow", 
		    "birth_year": "unknown", 
		    "gender": "female", 
		    "homeworld": "Zolan", 
		    "species": "Clawdite", 
		    "description": "Zam Wesell was a female Clawdite bounty hunter, which meant she was a shape-changer. Just prior to the Clone Wars she was working with Jango Fett to assassinate Naboo senator Padmé Amidala. After her attempts at bombing Amidala's landing platform and poisoning her with kouhuns failed, Wesell was apprehended by the Jedi Obi-Wan Kenobi and Anakin Skywalker. As she was about to reveal to them her partner's name, Fett killed her with a saberdart.",
		    "image": "http://vignette3.wikia.nocookie.net/starwars/images/7/7d/Clawdite.jpg/revision/latest?cb=20111001150105"
		},
		{
			"name": "Dexter Jettster", 
		    "height": "198", 
		    "mass": "102", 
		    "hair_color": "none", 
		    "skin_color": "brown", 
		    "eye_color": "yellow", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Ojom", 
		    "species": "Besalisk", 
		    "description": "Dexter 'Dex' Jettster was a male Besalisk with a colorful background who lived on the planet Coruscant and was the owner of Dex's Diner. Serving mostly hard workers from the area, the diner offered home-style cooked meals and freshly brewed ardees ('Jawa juice'). Jettster worked as the cook and employed two waitresses, Hermione Bagwa and her WA-7 waitress droid partner, FLO. It was shortly before the Clone Wars that Jedi Knight Obi-Wan Kenobi came to Dex's Diner to see if his old friend, Jettster, could identify a poisoned dart. Though few even knew of the planet Kamino, Jettster did from his days as a prospector and was able to identify the dart as originating from that planet. Furthermore, he knew of the native inhabitants, the Kaminoans, who were cloners of some repute and kept to themselves but were welcoming to those who brought credits. Jettster gently chided his old friend Kenobi who as a Jedi should have put more faith in another person's wisdom than the knowledge of the Jedi Archives.",
		    "image": "http://vignette3.wikia.nocookie.net/starwars/images/6/6c/DexterHS-SWE.jpg/revision/latest?cb=20111106014007"
		},
		{
			"name": "Lama Su", 
		    "height": "229", 
		    "mass": "88", 
		    "hair_color": "none", 
		    "skin_color": "grey", 
		    "eye_color": "black", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Kamino", 
		    "species": "Kaminoan", 
		    "description": "Lama Su was a male Kaminoan who was the Prime Minister of Kamino before and during the Clone Wars. He oversaw the creation of the Grand Army of the Republic.",
		    "image": "http://vignette1.wikia.nocookie.net/starwars/images/7/73/Lama_Su.jpg/revision/latest?cb=20080117165735"
		},
		{
			"name": "Taun We", 
		    "height": "213", 
		    "mass": "unknown", 
		    "hair_color": "none", 
		    "skin_color": "grey", 
		    "eye_color": "black", 
		    "birth_year": "unknown", 
		    "gender": "female", 
		    "homeworld": "Kamino", 
		    "species": "Kaminoan", 
		    "description": "Taun We was a female Kaminoan and administrative aide to Lama Su, Prime Minister of the planet Kamino during the Clone Wars. She greeted Obi-Wan Kenobi when he arrived on Kamino to investigate Jango Fett, and brought him before the Prime Minister to learn about the clone troopers Kamino had created for the Galactic Republic.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/9/9c/TaunWe.jpg/revision/latest?cb=20080117164920"
		},
		{
			"name": "Jocasta Nu", 
		    "height": "167", 
		    "mass": "unknown", 
		    "hair_color": "white", 
		    "skin_color": "fair", 
		    "eye_color": "blue", 
		    "birth_year": "unknown", 
		    "gender": "female", 
		    "homeworld": "Coruscant", 
		    "species": "Human", 
		    "description": "Jocasta Nu was a female human Jedi Master who served as the Chief librarian of the Jedi Archives during the Clone Wars. In this role, Nu would assist fellow Jedi in finding information they needed from the Jedi Archives, and controlled access to the restricted Holocron Vault. Sometime prior to the Invasion of Naboo, Nu sat on the Jedi Council. Shortly before the war, she assisted Obi-Wan Kenobi in his attempt to locate the planet Kamino in the Archives. After not finding any information, and Nu's insistence that any item that did not appear in the Archives did not exist, it was determined that information about Kamino had been erased from Jedi records. During the war, Nu was attacked by bounty hunter Cad Bane who stole a holocron from the Holocron Vault. She later assisted Ahsoka Tano in finding the thief who stole the Padawan's lightsaber.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/1/15/Jocasta_Nu_SWE.png/revision/latest?cb=20140606213247"
		},
		{
			"name": "R4-P17", 
		    "height": "96", 
		    "mass": "unknown", 
		    "hair_color": "none", 
		    "skin_color": "silver, red", 
		    "eye_color": "red, blue", 
		    "birth_year": "unknown", 
		    "gender": "female", 
		    "homeworld": "unknown", 
		    "species": "Droid", 
		    "description": "R4-P17, nicknamed R4, or Arfour, was the astromech droid attached to Obi-Wan Kenobi's Delta-7 Aethersprite-class starfighter and was often on board his Delta-7B Aethersprite-class starfighter and Eta-2 Actis-class light interceptor prior to and during the Clone Wars.",
		    "image": "http://vignette4.wikia.nocookie.net/starwars/images/6/6b/R4-P17.jpg/revision/latest?cb=20080429155212"
		},
		{
			"name": "Wat Tambor", 
		    "height": "193", 
		    "mass": "48", 
		    "hair_color": "none", 
		    "skin_color": "green, grey", 
		    "eye_color": "unknown", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Skako", 
		    "species": "Skakoan", 
		    "description": "Wat Tambor was a male Skakoan from the planet Skako and the foreman of the Techno Union. He pledged its resources to the Confederacy of Independent Systems, earning himself a seat on the Separatist Council during the Clone Wars. During the Clone Wars, Tambor commanded a Separatist invasion of Ryloth. His occupation of Ryloth was fiercely resisted by the indigenous Twi'leks, who remained loyal to the Galactic Republic. Following the battle, he was arrested by Jedi Master Mace Windu, and taken into Republic custody. However, Wat Tambor managed to escape Republic custody at an unknown date and resumed his position as foreman of the Techno Union. As the Clone Wars escalated, Wat Tambor took an interest in the captive ARC trooper Echo, who had been captured during a battle on The Citadel but was presumed to be dead by the Republic. Tambor kept an unconscious Echo in a stasis chamber and managed to extract information from Echo's mind about a strategy algorithm devised by the Clone Captain CT-7567. While officially professing the Techno Union's neutrality, Tambor secretly sold the algorithm to the Separatist Admiral Trench, who used it to great effect during a campaign to invade the Republic world of Anaxes. Tambor's dealings with the Separatists were exposed by a Republic infiltration team consisting of Rex, Clone Force 99, and the Jedi Knight Anakin Skywalker. During the last days of the Clone Wars, Wat Tambor and the rest of the Separatist Council relocated from the planet Utapau to Mustafar. Tambo and the other Separatist leaders were slaughtered on Mustafar by Darth Vader during his Mission to Mustafar. Following his death, the Galactic Empire, the successor government to the Galactic Republic, assumed control of the Techno Union's assets.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/f/f2/Wat_Tambor.jpeg/revision/latest?cb=20160226141309"
		},
		{
			"name": "San Hill", 
		    "height": "191", 
		    "mass": "unknown", 
		    "hair_color": "none", 
		    "skin_color": "grey", 
		    "eye_color": "gold", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Muunilinst", 
		    "species": "Muun", 
		    "description": "San Hill was a male Muun and Chairman of the InterGalactic Banking Clan during the Clone Wars. He pledged the support of the Banking Clan to the Confederacy of Independent Systems and served as the financial cartel's representative on the Separatist Council. Hill was slaughtered by Darth Vader on Mustafar following the end of the Clone Wars.",
		    "image": "http://vignette3.wikia.nocookie.net/starwars/images/3/3f/San.jpg/revision/latest?cb=20150925020600"
		},
		{
			"name": "Shaak Ti", 
		    "height": "178", 
		    "mass": "57", 
		    "hair_color": "none", 
		    "skin_color": "red, blue, white", 
		    "eye_color": "black", 
		    "birth_year": "unknown", 
		    "gender": "female", 
		    "homeworld": "Shili", 
		    "species": "Togruta", 
		    "description": "Shaak Ti was a female Togruta Jedi Master and member of the Jedi Council who served the Jedi Order in the waning years of the Galactic Republic. During the three-year conflict of the Clone Wars, she took the rank of Jedi General and supervised the training of the Republic's Clone troopers on Kamino.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/2/20/Shaak_Ti_closeup-SWE.png/revision/latest?cb=20150906213840"
		},
		{
			"name": "Grievous", 
		    "height": "216", 
		    "mass": "159", 
		    "hair_color": "none", 
		    "skin_color": "brown, white", 
		    "eye_color": "green, yellow", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Kalee", 
		    "species": "Kaleesh", 
		    "description": "Grievous was the Kaleesh cyborg Supreme Commander of the Droid Army of the Confederacy of Independent Systems for most of the Clone Wars. Originally a Kaleesh warrior from the planet Kalee, he chose to receive cybernetic implants to increase his combat prowess. He was recruited by Count Dooku to lead the Separatist Droid Army, and trained in the art of lightsaber combat. Over the course of the Clone Wars, Grievous' shrewd battle planning and ruthlessness caused him to become feared throughout the Galactic Republic. The Kaleesh cyborg successfully combated the Republic's Jedi Generals, maintaining a collection of trophies; the lightsabers of Jedi he had slain. He clashed with Padawan Ahsoka Tano and Jedi Master Obi-Wan Kenobi on multiple occasions. Under his command, the droid army wreaked havoc across the galaxy, attacking Kamino, where the Grand Army of the Republic's clone troopers were produced, and wiping out the Nightsisters of Dathomir, and even bombing a crucial power generator on Coruscant, the Republic's capital, to keep the war going during peace talks. Following the reemergence of the fallen Sith Lord Darth Maul, the former apprentice of his master Darth Sidious, Grievous forced his retreat and killed Mother Talzin, the former leader of the Nightsisters. Near the end of the war, Grievous led the attack on Coruscant aboard his flagship, the Invisible Hand, and successfully captured Supreme Chancellor Palpatine, secretly his master Darth Sidious. However, he was forced to retreat following the death of Count Dooku at the hands of Jedi Knight Anakin Skywalker and the crippling of his flagship, relocating to the remote Outer Rim world of Utapau. Palpatine leaked his location to the Jedi Council, who deployed Master Kenobi to kill the dreaded cyborg. Obi-Wan arrived in Pau City, a mining settlement in an Utapaun sinkhole, and the Jedi challenged him to a duel, with Kenobi's battalion of clones engaging Grievous' droid forces. Although he attempted to retreat in his personal starfighter, the Soulless One, his Jedi adversary shot the Kaleesh in his organ sack with Grievous' blaster rifle, resulting in the dreaded cyborg's demise.",
		    "image": "http://vignette1.wikia.nocookie.net/starwars/images/d/de/Grievoushead.jpg/revision/latest?cb=20100630082056"
		},
		{
			"name": "Tarfful", 
		    "height": "234", 
		    "mass": "136", 
		    "hair_color": "brown", 
		    "skin_color": "brown", 
		    "eye_color": "blue", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Kashyyyk", 
		    "species": "Wookiee", 
		    "description": "Tarfful was a male Wookiee chieftain and general who helped defend his native planet Kashyyyk during the Clone Wars. During the war, he led a band of Wookiees to answer a distress signal made by Chewbacca, who was imprisoned on the Trandoshan hunting grounds of Wasskah. Tarfful later participated in the Battle of Kashyyyk alongside Chewbacca and Jedi Master Yoda.",
		    "image": "http://vignette3.wikia.nocookie.net/starwars/images/3/37/Tarfful_RotS.png/revision/latest?cb=20140825183910"
		},
		{
			"name": "Raymus Antilles", 
		    "height": "188", 
		    "mass": "79", 
		    "hair_color": "brown", 
		    "skin_color": "light", 
		    "eye_color": "brown", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Alderaan", 
		    "species": "Human", 
		    "description": "Raymus Antilles was a male Human and the captain of the Corvette Sundered Heart at the time of the Clone Wars and the Galactic Civil War. He served the Royal Alderaan Civil Fleet under Senator Bail Prestor Organa. During the early stages of the Civil War, he served the Rebel Alliance in the fight against the Galactic Empire. He captained the Alderaan Diplomatic Cruiser Tantive IV before his death in 0 BBY at the hands of Darth Vader.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/6/61/RaymusAntilles.jpg/revision/latest?cb=20090216043211"
		},
		{
			"name": "Sly Moore", 
		    "height": "178", 
		    "mass": "48", 
		    "hair_color": "none", 
		    "skin_color": "pale", 
		    "eye_color": "white", 
		    "birth_year": "unknown", 
		    "gender": "female", 
		    "homeworld": "Umbara", 
		    "species": "unknown", 
		    "description": "Sly Moore was a female Umbaran who, according to rumors, had the ability to manipulate the minds of others, and served as the senior administrative aide to Supreme Chancellor Palpatine during the final days of the Galactic Republic. She remained by his side as he proclaimed that the Republic would be transformed into the Galactic Empire.",
		    "image": "http://vignette4.wikia.nocookie.net/starwars/images/e/ec/SlyMooreIsWatchingYouPoop-OfficialPix.jpg/revision/latest?cb=20130913002333"
		},
		{
			"name": "Tion Medon", 
		    "height": "206", 
		    "mass": "80", 
		    "hair_color": "none", 
		    "skin_color": "grey", 
		    "eye_color": "black", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "Utapau", 
		    "species": "Pau'an", 
		    "description": "Tion Medon was a male Pau'an and the Port Administrator of Pau City. A gaunt, gray-skinned humanoid, Tion Medon wore elaborate red robes and carried an ornate staff of office. He assisted Obi-Wan Kenobi during the late Clone Wars.",
		    "image": "http://vignette1.wikia.nocookie.net/starwars/images/4/43/Tion_Medon.jpg/revision/latest?cb=20091130182814"
		},
		{
			"name": "Finn", 
		    "height": "unknown", 
		    "mass": "unknown", 
		    "hair_color": "black", 
		    "skin_color": "dark", 
		    "eye_color": "dark", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "unknown", 
		    "species": "Human", 
		    "description": "Finn was a human male who served as a First Order stormtrooper, designation FN-2187 and known to his fellow soldiers as Eight-Seven. He was considered one of the group's best stormtroopers before he deserted to join the Resistance in their struggle against the First Order. Having left the First Order, he took on the name 'Finn' at the suggestion of Resistance pilot Poe Dameron, based on his stormtrooper designation, having never been given an actual name. After leaving the First Order, he reluctantly became involved in the droid BB-8's quest to rejoin the Resistance, and escaped the desert planet Jakku with BB-8 and a scavenger named Rey. Along with the famed smuggler Han Solo and Wookiee Chewbacca, Finn joined the Resistance's efforts to destroy the First Order's superweapon Starkiller Base after Rey was captured. However, after Solo's death at the hands of Kylo Ren in the battle at Starkiller Base, Finn was seriously injured in a lightsaber duel with the more experienced Kylo Ren. After Finn was disarmed, Rey regained consciousness and defeated Kylo Ren. He was taken by Rey to the Millennium Falcon, and was left in intensive care at the Resistance base while under a coma.",
		    "image": "http://vignette3.wikia.nocookie.net/starwars/images/3/38/FinnHS-Fathead.png/revision/latest?cb=20150908052707"
		},
		{
			"name": "Rey", 
		    "height": "unknown", 
		    "mass": "unknown", 
		    "hair_color": "brown", 
		    "skin_color": "light", 
		    "eye_color": "hazel", 
		    "birth_year": "unknown", 
		    "gender": "female", 
		    "homeworld": "unknown", 
		    "species": "Human", 
		    "description": "Rey was a human female scavenger who discovered her latent Force-sensitivity while on a quest to find the legendary Jedi Master Luke Skywalker and bring a new hope to a galaxy on the brink of war. Rey grew up in the wastes of the desert planet Jakku, where she was left by her family for reasons unknown to her. She spent her childhood dreaming of the day her family would return for her, meanwhile honing her skills as a scavenger and gaining a reputation as a warrior and scavenger in the junk fields of Niima Outpost. She became a talented scavenger in the planet's Starship Graveyard and gained skills as a linguist and a pilot, all of which were necessary to survive on the backwater planet. Despite the harsh realities of Jakku, Rey remained optimistic for her family's return and compassionate towards others. Rey's life changed forever when she encountered BB-8, a Resistance astromech droid who carried information about Luke Skywalker's whereabouts; and a stormtrooper named Finn who defected from the First Order. They were hunted by First Order forces and escaped from Jakku aboard the Millennium Falcon, which was soon retaken by two of its previous owners, Han Solo and Chewbacca. Solo brought them to Takodana to meet the pirate Maz Kanata, where Rey discovered the lightsaber that once belonged to Skywalker and his father. However, she rejected the idea that the lightsaber was calling to her. During a First Order assault on Kanata's castle, Rey was taken captive by the dark Force user Kylo Ren, who knew she had seen the map that BB-8 carried. On Starkiller Base, a First Order superweapon, Rey refused to give up the information and mounted an escape attempt. She encountered Finn, Solo, and Chewbacca after they had arrived to destroy the weapon and rescue her. After the weapon was damaged and Solo killed by Ren, who was actually his son Ben, Rey and Finn escaped into the forest to find the Millennium Falcon. Ren confronted them and, after Finn was injured, Rey fought Ren in a lightsaber duel and bested him. She and the others escaped to the Resistance base, where they learned Skywalker's location. Rey ventured to the planet Ahch-To, found the legendary Jedi Master, and presented him with his father's lightsaber.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/b/b4/Rey_infobox.png/revision/latest?cb=20160122041020"
		},
		{
			"name": "Poe Dameron", 
		    "height": "unknown", 
		    "mass": "unknown", 
		    "hair_color": "brown", 
		    "skin_color": "light", 
		    "eye_color": "brown", 
		    "birth_year": "unknown", 
		    "gender": "male", 
		    "homeworld": "unknown", 
		    "species": "Human", 
		    "description": "Poe Dameron was a human male starfighter pilot who served the New Republic and, later, the Resistance during its conflict with the First Order. He was born the son of Lieutenant Shara Bey and Sergeant Kes Dameron of the Alliance to Restore the Republic, Dameron followed in his late mother's footsteps and became a pilot, serving the New Republic Starfleet as the commander of Rapier Squadron. He grew disillusioned with the Republic's inaction to the First Order's violations of the Galactic Concordance, which led Dameron to defect to the Resistance, where he became one of General Leia Organa's most trusted operatives. Dameron flew under the callsign of Black Leader while piloting his specialized T-70 X-wing fighter, Black One. As the emerging conflict with the First Order grew more desperate, Dameron was sent to find Lor San Tekka on Jakku, who had part of a map to locate Organa's brother, Jedi Master Luke Skywalker. Dameron entrusted the map to his astromech droid, BB-8, and was captured by the First Order. He escaped with the help of a defecting stormtrooper, FN-2187—whom Dameron nicknamed Finn—and returned to the Resistance base on D'Qar after crashing a stolen TIE fighter on Jakku. He aided Finn, Rey, Han Solo, and Chewbacca with air support during the Battle on Takodana, and he later flew during the battle to destroy the superweapon known as Starkiller Base. During the battle, after the base was damaged by Solo, Finn, Rey, and Chewbacca, Dameron fired the shot that destroyed the Starkiller weapon, saving the Resistance from certain destruction.",
		    "image": "http://vignette3.wikia.nocookie.net/starwars/images/e/e8/PoeDameronHS-Fathead.png/revision/latest?cb=20150908053111"
		},
		{
			"name": "BB8", 
		    "height": "unknown", 
		    "mass": "unknown", 
		    "hair_color": "none", 
		    "skin_color": "none", 
		    "eye_color": "black", 
		    "birth_year": "unknown", 
		    "gender": "none", 
		    "homeworld": "unknown", 
		    "species": "Droid",
		    "description": "BB-8, sometimes spelled Beebee-Ate, was a BB unit astromech droid who operated approximately thirty years after the Battle of Endor. It had a dome head, similar to that of R2 series astromech droids, with the bulk of its body made up of a ball that the droid's head rolled on. BB-8 was mostly white, with some silver and orange on its body, as well as a black photoreceptor. The droid belonged to Resistance pilot Poe Dameron, whom he accompanied during his flights on his a T-70 X-wing fighter.",
		    "image": "http://vignette2.wikia.nocookie.net/starwars/images/6/68/BB8-Fathead.png/revision/latest?cb=20150908052432"
		}
	]
}